//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Private/Module/IGraphicModule.h>
#include <Framework/Graphic/Private/Texture/ITexture.h>

namespace ob {
    namespace graphic {


        //@―---------------------------------------------------------------------------
        //! @brief  グラフィックAPIタイプ
        //@―---------------------------------------------------------------------------
        enum class GraphicAPI {
            D3D12,      //!< Direct3D 12
            Vulkan,     //!< Vulkan
        };

        //@―---------------------------------------------------------------------------
        //! @brief  説明
        //@―---------------------------------------------------------------------------
        class GraphicModule:public singleton<GraphicModule> {
        public:

            //===============================================================
            // コンストラクタ / デストラクタ
            //===============================================================

            //@―---------------------------------------------------------------------------
            //! @brief              コンストラクタ
            //! 
            //! @param graphicAPI   使用するグラフィックAPI
            //@―---------------------------------------------------------------------------
            GraphicModule(GraphicAPI graphicAPI);

            Ref<ITexture> CreateTexture();

        private:

            unique_ptr<IGraphicModule> m_module;

        };






        //===============================================================
        // インライン関数
        //===============================================================
        //! @cond



        //! @endcond
    }// namespace graphic
}// namespcae ob