//***********************************************************
//! @file
//! @brief		ルートシグネチャ・インターフェイス
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Interface/GraphicObject.h>
#include <Framework/Graphic/Types/RootSignatureDesc.h>

//===============================================================
// クラス宣言
//===============================================================
namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief      ルートシグネチャ・インターフェイス
    //@―---------------------------------------------------------------------------
    class IRootSignature :public GraphicObject {
    public:

        //@―---------------------------------------------------------------------------
        //! @brief  妥当な状態か
        //@―---------------------------------------------------------------------------
        virtual bool isValid()const = 0;

        //@―---------------------------------------------------------------------------
        //! @brief      定義を取得
        //@―---------------------------------------------------------------------------
        virtual const RootSignatureDesc& getDesc()const = 0;
        /*
        //@―---------------------------------------------------------------------------
        //! @brief      ルートシグネチャに対応するディスクリプタプール、セットを作成するのに必要なプールサイズを取得。
        //! 
        //! @param[out] 
        //@―---------------------------------------------------------------------------
        virtual const u32& getDescriptorPoolSizes(s32 desc)const = 0;
        */
    };

}// namespace pb::graphic