//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#include <Foundation/Memory/Device/MemoryDevice.h>

//@―---------------------------------------------------------------------------
//! @brief	ヒープからメモリを確保してインスタンスを作成
//@―---------------------------------------------------------------------------
_NODISCARD _Ret_notnull_ _Post_writable_byte_size_(size) _VCRT_ALLOCATOR
void* operator new(size_t size)
{
    return ob::MemoryDevice::GetHeap().Allocate(size);
}

//@―---------------------------------------------------------------------------
//! @brief	ヒープからメモリを確保してインスタンス配列を作成
//@―---------------------------------------------------------------------------
_NODISCARD _Ret_notnull_ _Post_writable_byte_size_(size) _VCRT_ALLOCATOR
void* operator new[](size_t size)
{
    return ob::MemoryDevice::GetHeap().Allocate(size);
}

//@―---------------------------------------------------------------------------
//! @brief	ヒープからメモリを確保してインスタンスを作成
//@―---------------------------------------------------------------------------
void* operator new(size_t size, std::align_val_t alignment)
{
    return ob::MemoryDevice::GetHeap().Allocate(size, static_cast<ob::u32>(alignment));
}

//@―---------------------------------------------------------------------------
//! @brief	ヒープからメモリを確保してインスタンス配列を作成
//@―---------------------------------------------------------------------------
void* operator new[](size_t size, std::align_val_t alignment)
{
    return ob::MemoryDevice::GetHeap().Allocate(size, static_cast<ob::u32>(alignment));
}

//@―---------------------------------------------------------------------------
//! @brief	ヒープからメモリを確保してインスタンスを作成
//@―---------------------------------------------------------------------------
void* operator new(size_t size, ob::Heap& heap)noexcept
{
    return heap.Allocate(size);
}

//@―---------------------------------------------------------------------------
//! @brief	ヒープからメモリを確保してインスタンス配列を作成
//@―---------------------------------------------------------------------------
void* operator new[](size_t size, ob::Heap& heap)noexcept
{
    return heap.Allocate(size);
}

//@―---------------------------------------------------------------------------
//! @brief	ヒープからメモリを確保してインスタンスを作成
//@―---------------------------------------------------------------------------
void* operator new(size_t size, size_t alignment, ob::Heap& heap)noexcept
{
    return heap.Allocate(size, static_cast<ob::u32>(alignment));
}

//@―---------------------------------------------------------------------------
//! @brief	ヒープからメモリを確保してインスタンス配列を作成
//@―---------------------------------------------------------------------------
void* operator new[](size_t size, size_t alignment, ob::Heap& heap)noexcept
{
    return heap.Allocate(size, static_cast<ob::u32>(alignment));
}


//@―---------------------------------------------------------------------------
//! @brief	指定したインスタンスの開放
//@―---------------------------------------------------------------------------
void operator delete(void* ptr)noexcept
{
    ob::Heap::Free(ptr);
}

//@―---------------------------------------------------------------------------
//! @brief	指定したインスタンス配列の開放
//@―---------------------------------------------------------------------------
void operator delete[](void* ptr)noexcept
{
    ob::Heap::Free(ptr);
}

//@―---------------------------------------------------------------------------
//! @brief	指定したインスタンスの開放
//@―---------------------------------------------------------------------------
void operator delete(void* ptr, std::align_val_t alignment)noexcept
{
    ob::Heap::Free(ptr);
}

//@―---------------------------------------------------------------------------
//! @brief	指定したインスタンス配列の開放
//@―---------------------------------------------------------------------------
void operator delete[](void* ptr, std::align_val_t alignment)noexcept
{
    ob::Heap::Free(ptr);
}

//@―---------------------------------------------------------------------------
//! @brief	指定したインスタンスの開放
//@―---------------------------------------------------------------------------
void operator delete(void* ptr, ob::Heap& heap)noexcept
{
    ob::Heap::Free(ptr);
}

//@―---------------------------------------------------------------------------
//! @brief	指定したインスタンス配列の開放
//@―---------------------------------------------------------------------------
void operator delete[](void* ptr, ob::Heap& heap)noexcept
{
    ob::Heap::Free(ptr);
}

//@―---------------------------------------------------------------------------
//! @brief	指定したインスタンスの開放
//@―---------------------------------------------------------------------------
void operator delete(void* ptr, size_t alignment, ob::Heap& heap)noexcept
{
    ob::Heap::Free(ptr);
}

//@―---------------------------------------------------------------------------
//! @brief	指定したインスタンス配列の開放
//@―---------------------------------------------------------------------------
void operator delete[](void* ptr, size_t alignment, ob::Heap& heap)noexcept
{
    ob::Heap::Free(ptr);
}