//***********************************************************
//! @file
//! @brief		入力デバイス・インターフェイス
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Input/InputType.h>
#include <Framework/Core/Hash/Hash.h>

namespace ob::input {

	//@―---------------------------------------------------------------------------
	//! @brief		入力デバイス・インターフェイス
	//! 
	//! @details	入力デバイスを追加する場合はこのインターフェイスを実装する。<br>
	//!				デバイスは固有のIDを持つ必要があり、ボタン入力を取得する場合は Button 、<br>
	//!				軸入力を取得する場合は Axis のコンストラクタに固有IDを渡すことで値を取得できる。
	//!				InputManagerにデバイスを登録してください。
	//@―---------------------------------------------------------------------------
	class IInputDevice {
	public:

		//@―---------------------------------------------------------------------------
		//! @berif	デバイスタイプを取得
		//@―---------------------------------------------------------------------------
		virtual u32 getDeviceId()const = 0;

		//@―---------------------------------------------------------------------------
		//! @berif	更新
		//@―---------------------------------------------------------------------------
		virtual void update() {}

		//@―---------------------------------------------------------------------------
		//! @berif	ボタンの入力状態を取得
		//@―---------------------------------------------------------------------------
		virtual ButtonStates getButtonStates(u32 code)const { return {}; }

		//@―---------------------------------------------------------------------------
		//! @berif	軸の入力状態を取得
		//@―---------------------------------------------------------------------------
		virtual f32  getAxisValue(u32 code) const { return 0.0f; }

		//@―---------------------------------------------------------------------------
		//! @brief  ボタン入力イベントをバインド
		//@―---------------------------------------------------------------------------
		virtual bool bindButton(u32 code, ButtonState state, ButtonHandle& handle, const ButtonDelegate& func) { return false; }

		//@―---------------------------------------------------------------------------
		//! @brief  軸入力イベントをバインド
		//@―---------------------------------------------------------------------------
		virtual bool bindAxis(u32 code,AxisHandle& handle, const AxisDelegate& func) { return false; }

	};

}// namespcae ob