//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once
#include "../Base/PlatformSystemImplBase.h"

namespace ob {
    namespace platform {
        namespace detail {

            //@―---------------------------------------------------------------------------
            //! @brief  説明
            //@―---------------------------------------------------------------------------
            class PlatformSystemImpl:public PlatformSystemImplBase {
            public:

                //===============================================================
                // コンストラクタ / デストラクタ
                //===============================================================

                //@―---------------------------------------------------------------------------
                //! @brief  説明
                //@―---------------------------------------------------------------------------
                bool Startup();


            private:


                virtual Language GetLanguage() const override;

                virtual void AddSystemEventListener() override;

            };






            //===============================================================
            // インライン関数
            //===============================================================
            //! @cond



            //! @endcond
        }// namespace detail
    }// namespace platform
}// namespcae ob