//***********************************************************
//! @file
//! @brief		デバイス
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Interface/IDevice.h>

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief      デバイス
    //! 
    //! @details    デバイスは内部でのみ使用されるクラスです。
    //!             よって、System から直接取得できないようフレンドクラス指定された
    //!             このクラスから取得します。
    //@―---------------------------------------------------------------------------
    class Device {
    public:

        //@―---------------------------------------------------------------------------
        //! @brief  デバイスを取得
        //@―---------------------------------------------------------------------------
        static IDevice* Get();

    };

}// namespcae ob