//***********************************************************
//! @file
//! @brief		Bitmap
//! @author		Gajumaru
//***********************************************************

#include <Framework/Core/Graphic/Bitmap.h>

namespace ob::core {

    //@―---------------------------------------------------------------------------
    //! @brief      Bitmapクラスのコンストラクタ
    //! @param[in]  width   ビットマップの幅
    //! @param[in]  height  ビットマップの高さ
    //! @param[in]  color   ビットマップの初期色
    //@―---------------------------------------------------------------------------
    Bitmap::Bitmap(s32 width, s32 height, IntColor color) {
        resize(width, height, color);
    }

    //@―---------------------------------------------------------------------------
    //! @brief      Bitmapクラスのコンストラクタ
    //! @param[in]  path    画像ファイルのパス
    //! @param[in]  format  画像のフォーマット
    //@―---------------------------------------------------------------------------
    Bitmap::Bitmap(StringView path, ImageFormat format) {
        OB_NOTIMPLEMENTED();
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップの幅を取得する
    //! @return     ビットマップの幅
    //@―---------------------------------------------------------------------------
    s32 Bitmap::width() const noexcept {
        return m_size.width;
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップの高さを取得する
    //! @return     ビットマップの高さ
    //@―---------------------------------------------------------------------------
    s32 Bitmap::height() const noexcept {
        return m_size.height;
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップのサイズを取得する
    //! @return     ビットマップのサイズ
    //@―---------------------------------------------------------------------------
    Size Bitmap::size() const noexcept {
        return m_size;
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップのストライドを取得する
    //! @return     ビットマップのストライド
    //@―---------------------------------------------------------------------------
    s32 Bitmap::stride() const noexcept {
        return m_size.width * sizeof(IntColor);
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップのピクセル数を取得する
    //! @return     ビットマップのピクセル数
    //@―---------------------------------------------------------------------------
    size_t Bitmap::pixelCount() const noexcept {
        return m_size.width * m_size.height;
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップのバイトサイズを取得する
    //! @return     ビットマップのバイトサイズ
    //@―---------------------------------------------------------------------------
    size_t Bitmap::byteSize() const noexcept {
        return m_pixels.size() * sizeof(IntColor);
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップが空かどうかを判定する
    //! @return     ビットマップが空の場合はtrue、そうでない場合はfalse
    //@―---------------------------------------------------------------------------
    bool Bitmap::empty() const noexcept {
        return m_pixels.empty();
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップのメモリを最適化する
    //@―---------------------------------------------------------------------------
    void Bitmap::shrink_to_fit() {
        m_pixels.shrink_to_fit();
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップをクリアする
    //@―---------------------------------------------------------------------------
    void Bitmap::clear() {
        m_pixels.clear();
        m_size = Size(0, 0);
    }

    //@―---------------------------------------------------------------------------
    //! @brief      指定した行のピクセルデータへのポインタを取得する
    //! @param[in]  y   行インデックス
    //! @return     指定した行のピクセルデータへのポインタ
    //@―---------------------------------------------------------------------------
    IntColor* Bitmap::operator[](size_t y) {
        return m_pixels.data() + y * m_size.width;
    }

    //@―---------------------------------------------------------------------------
    //! @brief      指定した行のピクセルデータへのポインタを取得する (const版)
    //! @param[in]  y   行インデックス
    //! @return     指定した行のピクセルデータへのポインタ (const版)
    //@―---------------------------------------------------------------------------
    const IntColor* Bitmap::operator[](size_t y) const {
        return m_pixels.data() + y * m_size.width;
    }

    //@―---------------------------------------------------------------------------
    //! @brief      指定した座標のピクセルを取得する
    //! @param[in]  x   X座標
    //! @param[in]  y   Y座標
    //! @return     指定した座標のピクセル
    //@―---------------------------------------------------------------------------
    IntColor& Bitmap::at(s32 x, s32 y) {
        return m_pixels.at(y * m_size.width + x);
    }

    //@―---------------------------------------------------------------------------
    //! @brief      指定した座標のピクセルを取得する (const版)
    //! @param[in]  x   X座標
    //! @param[in]  y   Y座標
    //! @return     指定した座標のピクセル (const版)
    //@―---------------------------------------------------------------------------
    const IntColor& Bitmap::at(s32 x, s32 y) const {
        return m_pixels.at(y * m_size.width + x);
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップのデータへのポインタを取得する
    //! @return     ビットマップのデータへのポインタ
    //@―---------------------------------------------------------------------------
    IntColor* Bitmap::data() {
        return m_pixels.data();
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップのデータへのポインタを取得する (const版)
    //! @return     ビットマップのデータへのポインタ (const版)
    //@―---------------------------------------------------------------------------
    const IntColor* Bitmap::data() const {
        return m_pixels.data();
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップを指定した色で塗りつぶす
    //! @param[in]  color   塗りつぶす色
    //@―---------------------------------------------------------------------------
    void Bitmap::fill(IntColor color) {
        std::fill(m_pixels.begin(), m_pixels.end(), color);
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップのサイズを変更する
    //! @param[in]  width   新しい幅
    //! @param[in]  height  新しい高さ
    //! @param[in]  color   新しいビットマップの初期色
    //@―---------------------------------------------------------------------------
    void Bitmap::resize(s32 width, s32 height, IntColor color) {
        m_size = Size(width, height);
        m_pixels.clear();
        m_pixels.resize(width * height, color);
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップのサイズを変更する
    //! @param[in]  size    新しいサイズ
    //! @param[in]  color   新しいビットマップの初期色
    //@―---------------------------------------------------------------------------
    void Bitmap::resize(Size size, IntColor color) {
        m_size = size;
        m_pixels.clear();
        resize(size.width, size.height, color);
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップを水平方向に反転する
    //@―---------------------------------------------------------------------------
    void Bitmap::flipX() {
        for (s32 y = 0; y < m_size.height; ++y) {
            std::reverse(m_pixels.begin() + y * m_size.width, m_pixels.begin() + (y + 1) * m_size.width);
        }
    }

    //@―---------------------------------------------------------------------------
    //! @brief      ビットマップを垂直方向に反転する
    //@―---------------------------------------------------------------------------
    void Bitmap::flipY() {
        std::reverse(m_pixels.begin(), m_pixels.end());
        flipX();
    }

    //@―---------------------------------------------------------------------------
    //! @brief      指定した範囲でクリップされたビットマップを取得する
    //! @param[in]  rect    クリップ範囲
    //! @return     クリップされたビットマップ
    //@―---------------------------------------------------------------------------
    Bitmap Bitmap::clipped(const IntRect& rect) const {
        Bitmap result;
        result.resize(rect.width(), rect.height());

        for (s32 y = 0; y < rect.height(); ++y) {
            std::copy(
                m_pixels.begin() + (rect.top + y) * m_size.width + rect.left,
                m_pixels.begin() + (rect.top + y) * m_size.width + rect.left + rect.width(),
                result.m_pixels.begin() + y * rect.width()
            );
        }

        return result;
    }

    //@―---------------------------------------------------------------------------
    //! @brief      指定した範囲でクリップされたビットマップを取得する
    //! @param[in]  x   クリップ範囲の左上のX座標
    //! @param[in]  y   クリップ範囲の左上のY座標
    //! @param[in]  w   クリップ範囲の幅
    //! @param[in]  h   クリップ範囲の高さ
    //! @return     クリップされたビットマップ
    //@―---------------------------------------------------------------------------
    Bitmap Bitmap::clipped(s32 x, s32 y, s32 w, s32 h) const {
        return clipped(IntRect(x, y, w, h));
    }

}