//***********************************************************
//! @file
//! @brief		CRCハッシュ関数
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob {

    //@―---------------------------------------------------------------------------
    //! @brief ハッシュ値の計算を行うクラス
    //@―---------------------------------------------------------------------------
    class OB_API CRCHash {
    public:

        //@―---------------------------------------------------------------------------
        //! @brief 指定した文字列のハッシュ値を求める
        //! 
        //! @param str 元文字配列
        //! @param len 配列の長さ
        //! @return ハッシュ値
        //@―---------------------------------------------------------------------------
        static uint32_t compute(const char* str, int len = -1);	


        //@―---------------------------------------------------------------------------
        //! @brief 指定した文字列のハッシュ値を求める
        //! 
        //! @param str 元文字配列
        //! @param len 配列の長さ
        //! @return ハッシュ値
        //@―---------------------------------------------------------------------------
        static uint32_t compute(const wchar_t* str, int len = -1);


        //@―---------------------------------------------------------------------------
        //! @brief 指定した文字列のハッシュ値を求める
        //! 
        //! @param str 元文字配列
        //! @param len 配列の長さ
        //! @return ハッシュ値
        //@―---------------------------------------------------------------------------
        static uint32_t compute(const char16_t* str, int len = -1);


        //@―---------------------------------------------------------------------------
        //! @brief 指定した文字列のハッシュ値を求める
        //! 
        //! @param str 元文字配列
        //! @param len 配列の長さ
        //! @return ハッシュ値
        //@―---------------------------------------------------------------------------
        static uint32_t compute(const char32_t* str, int len = -1);

    };

    //! @cond
    namespace detail {
        struct CRCHashInternal {
            static const unsigned* GetCRCTable();
        };

    } // namespace detail
    //! @endcond

} // namespace ob
