//***********************************************************
//! @file
//! @brief		ユーティリティ
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Types/TextureFormat.h>
#include <dxgi.h>

namespace ob::graphic::dx12 {

    //@―---------------------------------------------------------------------------
    //! @brief  ユーティリティ
    //@―---------------------------------------------------------------------------
    class Utility {
    public:

        //@―---------------------------------------------------------------------------
        //! @brief  デバッグレイヤメッセージを取得
        //@―---------------------------------------------------------------------------
        static String getDebugLayerLastString(ID3D12Device* pDevice,s32 count=3);

        //@―---------------------------------------------------------------------------
        //! @brief  エラーメッセージを取得
        //@―---------------------------------------------------------------------------
        static String getErrorMessage(DWORD errorCode);


        //@―---------------------------------------------------------------------------
        //! @brief  HRESULTのエラーログを出力
        //@―---------------------------------------------------------------------------
        static void outputErrorLog(HRESULT result, StringView message = TC(""));


        //@―---------------------------------------------------------------------------
        //! @brief  HRESULTのFatalログを出力
        //@―---------------------------------------------------------------------------
        static void outputFatalLog(HRESULT result, StringView message = TC(""));

        
        //@―---------------------------------------------------------------------------
        //! @brief  D3D12_RESOURCE_DESC から D3D12_SRV_DIMENSIONを取得
        //@―---------------------------------------------------------------------------
        static D3D12_SRV_DIMENSION getSrvDimention(const D3D12_RESOURCE_DESC& desc);

    };

}// namespcae ob::graphic::dx12