//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::rendering {

	class RenderContext;
	class CommandBuffer;

	//@―---------------------------------------------------------------------------
	//! @brief  説明
	//@―---------------------------------------------------------------------------
	class IRenderPipeline {
	public:

		//@―---------------------------------------------------------------------------
		//! @brief  描画処理
		//@―---------------------------------------------------------------------------
		virtual void render(CommandBuffer& command,const RenderContext& context) = 0;

	};

}// namespcae ob