//***********************************************************
//! @file
//! @brief		パイプラインステート実装(DirectX12)
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/RHI/PipelineState.h>

//===============================================================
// 前方宣言
//===============================================================
namespace ob::rhi::vulkan {
    class DeviceImpl;
}


//===============================================================
// クラス定義
//===============================================================
namespace ob::rhi::vulkan {

    //@―---------------------------------------------------------------------------
    //! @brief		グラフィック・パイプライン実装(DirectX12)
    //@―---------------------------------------------------------------------------
    class PipelineStateImpl :public PipelineState {
    public:

        //@―---------------------------------------------------------------------------
        //! @brief		コンストラクタ
        //@―---------------------------------------------------------------------------
        PipelineStateImpl(const PipelineStateDesc& desc);


        //@―---------------------------------------------------------------------------
        //! @brief      定義を取得
        //@―---------------------------------------------------------------------------
        //const PipelineStateDesc& getDesc()const override { return m_desc; };


    private:
        // PipelineState を介して継承されました
        const String& getName() const override;

        const PipelineStateDesc m_desc;

	    vk::raii::Pipeline m_pipeline = nullptr;


    };






    //===============================================================
    // インライン関数
    //===============================================================
    //! @cond

    //! @endcond
}