//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphics/RenderPipeline.h>

namespace ob::graphics {

	//@―---------------------------------------------------------------------------
	//! @brief      描画パイプライン
    //! @details    描画呼び出しの基底となるクラスです。プログラム内で1つだけ存在します。
	//@―---------------------------------------------------------------------------
	class SampleRenderPipeline : public RenderPipeline {
	public:

		//@―---------------------------------------------------------------------------
		//! @brief  描画処理
		//@―---------------------------------------------------------------------------
		void render(RenderContext& context, Span<const Ref<Camera>> cameras) override;

	};

}