//***********************************************************
//! @file
//! @brief		モジュール読み込みインターフェイス
//! @author		Gajumaru
//***********************************************************
#pragma once
#include "../IModule.h"

namespace ob::platform {

    //@―---------------------------------------------------------------------------
    //! @brief  モジュール読み込みインターフェイス
    //@―---------------------------------------------------------------------------
    class IModuleLoader {
    public:

        virtual ~IModuleLoader() = default;

        //@―---------------------------------------------------------------------------
        //! @brief  モジュール・インターフェイスの取得
        //@―---------------------------------------------------------------------------
        virtual IModule* GetInterface() = 0;

    };

}// namespace ob::platform