//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#include "RefObject.h"


namespace ob {

    //@―---------------------------------------------------------------------------
    //! @brief  コンストラクタ
    //@―---------------------------------------------------------------------------
    RefObject::RefObject()
        :m_referenceCount(0) {
    }


    //@―---------------------------------------------------------------------------
    //! @brief  デストラクタ
    //@―---------------------------------------------------------------------------
    RefObject::~RefObject() {
        OB_REQUIRE(m_referenceCount <= 0);
    }


    //@―---------------------------------------------------------------------------
    //! @brief  参照カウントの取得
    //! 
    //! @param pObj 捜査対象の IRefObject
    //@―---------------------------------------------------------------------------
    s32 RefObjectHelper::GetReferenceCount(IRefObject* pObj) {
        if (pObj == nullptr)return 0;
        return pObj->GetReferenceCount();
    }


    //@―---------------------------------------------------------------------------
    //! @brief  参照の追加
    //! 
    //! @param pObj 捜査対象の IRefObject
    //@―---------------------------------------------------------------------------
    s32 RefObjectHelper::Retain(IRefObject* pObj) {
        if (pObj == nullptr)return 0;
        return pObj->Retain();
    }


    //@―---------------------------------------------------------------------------
    //! @brief  参照の解放
    //! 
    //! @param pObj 捜査対象の IRefObject
    //@―---------------------------------------------------------------------------
    s32 RefObjectHelper::Release(IRefObject* pObj) {
        if (pObj == nullptr)return 0;
        return pObj->Release();
    }


}// namespace ob