//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#include <Framework/Graphic/Utility/TextureReader.h>

namespace ob::graphic
{

    //@―---------------------------------------------------------------------------
    //! @brief  説明
    //@―---------------------------------------------------------------------------

    //@―---------------------------------------------------------------------------
    //! @brief  説明
    //@―---------------------------------------------------------------------------
    TextureReader::TextureReader(String path) {

    }
    TextureReader::TextureReader(String path, TextureExtension extension) {

    }

}// namespace ob