//***********************************************************
//! @file
//! @brief		ウィンドウ(Windows)
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Platform/Window/Window.h>
#include <Framework/Platform/Type/Language.h>

//============================================
// 前方宣言
//============================================
namespace ob::platform::detail {
    class PlatformSystemImpl;
}

//============================================
// クラス宣言
//============================================
namespace ob::platform {

    //@―---------------------------------------------------------------------------
    //! @brief  プラットフォーム・システム
    //@―---------------------------------------------------------------------------
    class PlatformSystem :public Singleton<PlatformSystem> {
    public:

        PlatformSystem();
        ~PlatformSystem();

        //@―---------------------------------------------------------------------------
        //! @brief  システムを起動する
        //@―---------------------------------------------------------------------------
        bool startup();

        //@―---------------------------------------------------------------------------
        //! @brief  システムを終了する
        //@―---------------------------------------------------------------------------
        void shutdown();

        //@―---------------------------------------------------------------------------
        //! @brief  プラットフォームのシステム言語を取得する
        //@―---------------------------------------------------------------------------
        Language getSystemLanguage()const;

    private:

        UPtr<detail::PlatformSystemImpl> m_implement;

    };

}// namespace ob::platform