//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once
#include "PlatformSystem.h"
#include "Platforms/Windows/PlatformSystemImpl.h"

namespace ob::platform {

    //@―---------------------------------------------------------------------------
    //! @brief  コンストラクタ
    //@―---------------------------------------------------------------------------
    PlatformSystem::PlatformSystem() {
    }


    //@―---------------------------------------------------------------------------
    //! @brief  デストラクタ
    //@―---------------------------------------------------------------------------
    PlatformSystem::~PlatformSystem() = default;


    //@―---------------------------------------------------------------------------
    //! @brief  システムの言語を取得する
    //@―---------------------------------------------------------------------------
    Language PlatformSystem::getSystemLanguage()const {
        return m_impl->getSystemLanguage();
    }

}// namespace ob::platform

