//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once
#include "PlatformSystem.h"
#include "Platforms/Windows/PlatformSystemImpl.h"

namespace ob::platform {

    //@―---------------------------------------------------------------------------
    //! @brief  システムを起動する
    //@―---------------------------------------------------------------------------
    bool PlatformSystem::Startup() {
        return true;
    }


    //@―---------------------------------------------------------------------------
    //! @brief  システムを終了する
    //@―---------------------------------------------------------------------------
    void PlatformSystem::Shutdown() {

    }


    //@―---------------------------------------------------------------------------
    //! @brief  メインウィンドウを取得する
    //@―---------------------------------------------------------------------------
    Ref<Window> PlatformSystem::GetMainWindow() {
        return nullptr;
    }


    //@―---------------------------------------------------------------------------
    //! @brief  システムの言語を取得する
    //@―---------------------------------------------------------------------------
    Language PlatformSystem::GetUserLanguage()const {
        return m_implement->GetLanguage();
    }

}// namespace ob::platform

