//***********************************************************
//! @file
//! @brief		ウィンドウ(Windows)
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Platform/Window/Window.h>
#include <Framework/Platform/Type/Language.h>

namespace ob::platform {
    //! @cond
    namespace detail {
        class PlatformSystemImpl;
    }
    //! @endcond

    //@―---------------------------------------------------------------------------
    //! @brief  プラットフォーム・システム
    //@―---------------------------------------------------------------------------
    class PlatformSystem :Singleton<PlatformSystem> {
    public:

        //@―---------------------------------------------------------------------------
        //! @brief  システムを起動する
        //@―---------------------------------------------------------------------------
        bool Startup();

        //@―---------------------------------------------------------------------------
        //! @brief  システムを終了する
        //@―---------------------------------------------------------------------------
        void Shutdown();

        //@―---------------------------------------------------------------------------
        //! @brief  メインウィンドウを取得する
        //@―---------------------------------------------------------------------------
        Ref<Window> GetMainWindow();

        //@―---------------------------------------------------------------------------
        //! @brief  プラットフォームのシステム言語を取得する
        //@―---------------------------------------------------------------------------
        Language GetUserLanguage()const;



    private:

        std::unique_ptr<detail::PlatformSystemImpl> m_implement;

    };

}// namespace ob::platform