//***********************************************************
//! @file
//! @brief		ヒープメソッドモード
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Core/CoreTypes.h>

namespace ob::core {

    //@―---------------------------------------------------------------------------
    //! @brief  ヒープメソッドモード
    //@―---------------------------------------------------------------------------
    enum class HeapMethodType {
        Invalid,
        System,
        Mimalloc,
        TLSF,
    };

}