//***********************************************************
//! @file
//! @brief		テクスチャ実装(DirectX12)
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Interface/ITexture.h>
#include <Framework/Graphic/Types/TextureDesc.h>



//===============================================================
// 前方宣言
//===============================================================
namespace ob::graphic::dx12 {
    class DeviceImpl;
}


//===============================================================
// クラス定義
//===============================================================
namespace ob::graphic::dx12 {

    class TextureImpl :public ITexture {
    public:

        //@―---------------------------------------------------------------------------
        //! @brief      コンストラクタ
        //@―---------------------------------------------------------------------------
        TextureImpl(DeviceImpl& rDevice, const TextureDesc& desc, StringView name);


        //@―---------------------------------------------------------------------------
        //! @brief      定義を取得
        //@―---------------------------------------------------------------------------
        const TextureDesc& getDesc() const override;


    public:

        //@―---------------------------------------------------------------------------
        //! @brief      シェーダリソースビューを取得
        //@―---------------------------------------------------------------------------
        ID3D12DescriptorHeap* getSRV();



    protected:

        //@―---------------------------------------------------------------------------
        //! @brief      リソースを持っているか
        //@―---------------------------------------------------------------------------
        bool hasResource()const;

        //@―---------------------------------------------------------------------------
        //! @brief      シェーダリソースビューを生成
        //@―---------------------------------------------------------------------------
        bool createSRV(ID3D12Device& rNativeDevice,D3D12_CPU_DESCRIPTOR_HANDLE& handle);


    private:
    protected:

        TextureDesc                 m_desc;         //!< 定義
        ComPtr<ID3D12Resource>      m_resource;     //!< リソース
        ComPtr<ID3D12DescriptorHeap> m_srvHeap;     //!< シェーダ・リソース・ビュー
        //vector<Texture> m_mipmaps;              //!< ミップマップ


    };

}// namespace ob::graphic::dx12



//===============================================================
// インライン
//===============================================================
namespace ob::graphic::dx12 {

    //@―---------------------------------------------------------------------------
    //! @brief      定義を取得
    //@―---------------------------------------------------------------------------
    inline const TextureDesc& TextureImpl::getDesc() const {
        return m_desc;
    }

}// namespace ob::graphic::dx12
