//***********************************************************
//! @file
//! @brief		テクスチャ実装(DirectX12)
//! @author		Gajumaru
//***********************************************************
#include "TextureImpl.h"
#include <Plugins/GraphicDirectX12/Device/DeviceImpl.h>

namespace ob::graphic::dx12 {

    //@―---------------------------------------------------------------------------
    //! @brief      コンストラクタ
    //@―---------------------------------------------------------------------------
    TextureImpl::TextureImpl(DeviceImpl& rDevice, const TextureDesc& desc, StringView name) {

    }


    //@―---------------------------------------------------------------------------
    //! @brief      テクスチャ・サイズを取得
    //@―---------------------------------------------------------------------------
    Size TextureImpl::size() {
        return m_desc.size;
    }


    //@―---------------------------------------------------------------------------
    //! @brief      テクスチャ・フォーマットを取得
    //@―---------------------------------------------------------------------------
    TextureFormat TextureImpl::format()const {
        return m_desc.format;
    }


    //@―---------------------------------------------------------------------------
    //! @brief      テクスチャ使用法を取得
    //@―---------------------------------------------------------------------------
    ResourceUsage TextureImpl::usage()const {
        return m_desc.usage;
    }


    //@―---------------------------------------------------------------------------
    //! @brief      ミップマップを持っているか
    //@―---------------------------------------------------------------------------
    bool TextureImpl::hasMipmap()const {
        return 0 < m_desc.mipLevel;
    }

}// ob::graphic::dx12