//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Public/Texture/TextureFormat.h>
#include <dxgi.h>

namespace ob {
    namespace graphic {

        //@―---------------------------------------------------------------------------
        //! @brief  説明
        //@―---------------------------------------------------------------------------
        class D3D12Utility {
        public:

            //@―---------------------------------------------------------------------------
            //! @brief  TextureFormat を DXGI_FORMAT に変換
            //@―---------------------------------------------------------------------------
            static DXGI_FORMAT convertTextureFormat(TextureFormat format);

        private:



        };






        //===============================================================
        // インライン関数
        //===============================================================
        //! @cond



        //! @endcond
    }// namespace graphic
}// namespcae ob