//***********************************************************
//! @file
//! @brief		
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Core/Utility/Ref.h>
#include <Framework/Graphics/Forward.h>
#include <Framework/Graphics/Camera.h>

namespace ob::graphics {

	//@―---------------------------------------------------------------------------
	//! @brief      描画機能
	//! @details    O3DEでいうところのFeatureProcessor。
	//!				初期状態は非アクティブです。
	//@―---------------------------------------------------------------------------
	class RenderFeature {
	public:

		OB_RTTI();

		virtual ~RenderFeature(){}

		//@―---------------------------------------------------------------------------
		//! @brief      アクティブにする
		//@―---------------------------------------------------------------------------
		virtual void activate() {}

		//@―---------------------------------------------------------------------------
		//! @brief      非アクティブにする
		//@―---------------------------------------------------------------------------
		virtual void deactivate() {}

		//@―---------------------------------------------------------------------------
		//! @brief      RenderViewごとに必要な描画ステップを追加する
		//@―---------------------------------------------------------------------------
		virtual void createSteps(RenderStepInjector& injector) {}

	public:

		//@―---------------------------------------------------------------------------
		//! @brief      所属シーンを取得する
		//@―---------------------------------------------------------------------------
		RenderScene& getScene()const { return m_scene; }

	protected:
		RenderFeature(RenderScene& scene) :m_scene(scene) {}
	private:
		RenderScene& m_scene;
	};

}