//***********************************************************
//! @file
//! @brief		入力系のタイプ宣言
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Core/Misc/Duration.h>
#include <Framework/Input/InputType.h>

namespace ob::input {

	//@―---------------------------------------------------------------------------
	//! @brief		ボタン
	//! 
	//! @details	「キーボードのAボタン」や「マウスの左ボタン」など、トグル入力を扱います。
	//@―---------------------------------------------------------------------------
	class Button {
	public:

		//@―---------------------------------------------------------------------------
		//! @berif	デフォルトコンストラクタ
		//@―---------------------------------------------------------------------------
		Button() = default;

		//@―---------------------------------------------------------------------------
		//! @brief			コンストラクタ
		//! @param deviceID	デバイスタイプ
		//! @param code		コード
		//! @param user		ユーザ番号
		//@―---------------------------------------------------------------------------
		constexpr Button(u32 deviceID, u32 code, u32 user = 0) :m_deviceId(deviceID),m_code(code), m_user(user) {}

		//@―---------------------------------------------------------------------------
		//! @berif	コンストラクタ
		//@―---------------------------------------------------------------------------
		template<typename T>
		constexpr Button(u32 type, T code, u32 user = 0) : Button(type, enum_cast(code), user) {}

	public:

		//@―---------------------------------------------------------------------------
		//! @berif	状態が state か
		//@―---------------------------------------------------------------------------
		//StringView name()const;

		//@―---------------------------------------------------------------------------
		//! @berif	状態が state か
		//@―---------------------------------------------------------------------------
		//Duration pressedDuration()const;


		//@―---------------------------------------------------------------------------
		//! @berif	状態が state か
		//@―---------------------------------------------------------------------------
		bool is(ButtonState state)const;

		//@―---------------------------------------------------------------------------
		//! @berif	押された瞬間か
		//@―---------------------------------------------------------------------------
		bool down()const;

		//@―---------------------------------------------------------------------------
		//! @berif	離された瞬間か
		//@―---------------------------------------------------------------------------
		bool up()const;

		//@―---------------------------------------------------------------------------
		//! @berif	押されているか
		//@―---------------------------------------------------------------------------
		bool pressed()const;

		//@―---------------------------------------------------------------------------
		//! @berif	離されているか
		//@―---------------------------------------------------------------------------
		bool released()const;

	public:

		//@―---------------------------------------------------------------------------
		//! @berif	バインド
		//! 
		//! @param handle	イベントハンドル
		//! @param func		コールバック
		//@―---------------------------------------------------------------------------
		bool bindDown(ButtonHandle& handle, const ButtonDelegate& func)const;
		bool bindUp(ButtonHandle& handle, const ButtonDelegate& func)const;
		bool bindPressed(ButtonHandle& handle, const ButtonDelegate& func)const;
		bool bindReleased(ButtonHandle& handle, const ButtonDelegate& func)const;

	private:

		bool bind(ButtonState state, ButtonHandle& handle, const ButtonDelegate& func)const;

	private:
		u32 m_deviceId;
		u32 m_user;
		u32 m_code;
	};

}