//***********************************************************
//! @file
//! @brief		デバイス実装(DirectX12)
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Interface/IDevice.h>

//===============================================================
// クラス宣言
//===============================================================
namespace ob::graphic::dx12 {

    class DeviceImpl :public IDevice {
    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================
        
        //@―---------------------------------------------------------------------------
        //! @brief  コンストラクタ
        //@―---------------------------------------------------------------------------
        DeviceImpl(FeatureLevel featureLevel);


        //===============================================================
        // 生成
        //===============================================================

        //@―---------------------------------------------------------------------------
        //! @brief  スワップ・チェーンを生成
        //@―---------------------------------------------------------------------------
        ISwapChain* createSwapChain(SwapchainDesc& desc)override;


        //@―---------------------------------------------------------------------------
        //! @brief  テクスチャを生成
        //@―---------------------------------------------------------------------------
        ITexture* createTexture(const TextureDesc& desc, StringView name)override;


        //===============================================================
        // ゲッター
        //===============================================================
        
        //@―---------------------------------------------------------------------------
        //! @brief  ネイティブ・デバイスを取得
        //@―---------------------------------------------------------------------------
        ComPtr<ID3D12Device>& getNativeDevice();

        //@―---------------------------------------------------------------------------
        //! @brief  ファクトリを取得
        //@―---------------------------------------------------------------------------
        ComPtr<IDXGIFactory4>& getFactory();

        //@―---------------------------------------------------------------------------
        //! @brief  システム・コマンド・キューを取得
        //@―---------------------------------------------------------------------------
        ComPtr<ID3D12CommandQueue>& getCommandQueue();


    private:

        void initialize();

        HRESULT initializeDXGIDevice();
        HRESULT initializeCommand();

    private:

        FeatureLevel                    m_featureLevel;             // フィーチャーレベル
        ComPtr<ID3D12Device>            m_device;                   // D3D12のデバイス本体
        ComPtr<IDXGIFactory4>           m_dxgiFactory;              // DXGIインターフェイス
        ComPtr<ID3D12CommandAllocator>  m_commandAllocator;         // コマンドアロケータ
        ComPtr<ID3D12CommandQueue>      m_commandQueue;             // コマンドキュー


    };
}// namespace ob::graphic::dx12






//===============================================================
// インライン
//===============================================================
namespace ob::graphic::dx12 {

    //@―---------------------------------------------------------------------------
    //! @brief  ネイティブ・デバイスを取得
    //@―---------------------------------------------------------------------------
    inline ComPtr<ID3D12Device>& DeviceImpl::getNativeDevice() {
        return m_device;
    }


    //@―---------------------------------------------------------------------------
    //! @brief  ファクトリを取得
    //@―---------------------------------------------------------------------------
    inline ComPtr<IDXGIFactory4>& DeviceImpl::getFactory() {
        return m_dxgiFactory;
    }


    //@―---------------------------------------------------------------------------
    //! @brief  システム・コマンド・キューを取得
    //@―---------------------------------------------------------------------------
    inline ComPtr<ID3D12CommandQueue>& DeviceImpl::getCommandQueue() {
        return m_commandQueue;
    }

}// namespace ob::graphic::dx12