//***********************************************************
//! @file
//! @brief		デバイス実装(DirectX12)
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Interface/IDevice.h>
#include <Framework/Graphic/Types/FeatureLevel.h>

//===============================================================
// クラス定義
//===============================================================
namespace ob::graphic::dx12 {

    class DeviceImpl :public IDevice {
    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================
        
        //@―---------------------------------------------------------------------------
        //! @brief  コンストラクタ
        //@―---------------------------------------------------------------------------
        DeviceImpl(FeatureLevel featureLevel);


        //@―---------------------------------------------------------------------------
        //! @brief  妥当な状態か
        //@―---------------------------------------------------------------------------
        bool isValid()const override;


        //===============================================================
        // 更新
        //===============================================================
        void update()override;


        //===============================================================
        // 生成
        //===============================================================

        //@―---------------------------------------------------------------------------
        //! @brief  スワップ・チェーンを生成
        //@―---------------------------------------------------------------------------
        ob::graphic::ISwapChain* createSwapChain(const SwapchainDesc& desc)override;


        //@―---------------------------------------------------------------------------
        //! @brief  レンダーパス生成
        //@―---------------------------------------------------------------------------
        ob::graphic::IRenderPass* createRenderPass(const RenderPassDesc& desc)override;


        //@―---------------------------------------------------------------------------
        //! @brief  フレームバッファを生成
        //@―---------------------------------------------------------------------------
        ob::graphic::IFrameBuffer* createFrameBuffer(const FrameBufferDesc& desc)override;


        //@―---------------------------------------------------------------------------
        //! @brief  ルートシグネチャを生成
        //@―---------------------------------------------------------------------------
        ob::graphic::IRootSignature* createRootSignature(const RootSignatureDesc& desc)override;


        //@―---------------------------------------------------------------------------
        //! @brief  パイプラインステートを生成
        //@―---------------------------------------------------------------------------
        ob::graphic::IPipelineState* createPipelineState(const PipelineStateDesc& desc)override;


        //@―---------------------------------------------------------------------------
        //! @brief  テクスチャを生成
        //@―---------------------------------------------------------------------------
        ob::graphic::ITexture* createTexture(const TextureDesc& desc)override;


        //@―---------------------------------------------------------------------------
        //! @brief  レンダーテクスチャを生成
        //@―---------------------------------------------------------------------------
        ob::graphic::IRenderTexture* createRenderTexture(const gsl::span<TextureDesc> targets, const TextureDesc& depth)override;


        //@―---------------------------------------------------------------------------
        //! @brief  バッファーを生成
        //@―---------------------------------------------------------------------------
        ob::graphic::IBuffer* createBuffer(const BufferDesc& desc) override;

        //@―---------------------------------------------------------------------------
        //! @brief  シェーダを生成
        //@―---------------------------------------------------------------------------
        ob::graphic::IShader* createShader(const String&,ShaderStage) override;


        //@―---------------------------------------------------------------------------
        //! @brief  シェーダを生成
        //@―---------------------------------------------------------------------------
        ob::graphic::IShader* createShader(const Blob&, ShaderStage) override;


        //===============================================================
        // ゲッター
        //===============================================================
        
        //@―---------------------------------------------------------------------------
        //! @brief  ネイティブ・デバイスを取得
        //@―---------------------------------------------------------------------------
        ComPtr<ID3D12Device>& getNativeDevice();

        //@―---------------------------------------------------------------------------
        //! @brief  ファクトリを取得
        //@―---------------------------------------------------------------------------
        ComPtr<IDXGIFactory4>& getFactory();

        //@―---------------------------------------------------------------------------
        //! @brief  システム・コマンド・キューを取得
        //@―---------------------------------------------------------------------------
        ComPtr<ID3D12CommandQueue>& getCommandQueue();

        //@―---------------------------------------------------------------------------
        //! @brief  システム・コマンド・リストを取得
        //@―---------------------------------------------------------------------------
        ComPtr<ID3D12GraphicsCommandList>& getSystemCommandList();


    private:

        bool initialize();

        bool initializeDXGIDevice();
        bool initializeCommand();
        bool initializeVideoCardInfo();

    private:

        FeatureLevel                        m_featureLevel;             // フィーチャーレベル
        ComPtr<ID3D12Device>                m_device;                   // D3D12のデバイス本体
        ComPtr<IDXGIFactory4>               m_dxgiFactory;              // DXGIインターフェイス
        ComPtr<ID3D12CommandAllocator>      m_commandAllocator;         // コマンドアロケータ
        ComPtr<ID3D12CommandQueue>          m_commandQueue;             // コマンドキュー
        ComPtr<ID3D12GraphicsCommandList>   m_systemCmdList;            // システムコマンドリスト
        ComPtr<ID3D12Debug>                 m_debugLayer;               // デバッグレイヤ
        ComPtr<ID3D12Debug1>                m_debugLayer1;              // デバッグレイヤ

    };
}// namespace ob::graphic::dx12






//===============================================================
// インライン
//===============================================================
namespace ob::graphic::dx12 {

    //@―---------------------------------------------------------------------------
    //! @brief  ネイティブ・デバイスを取得
    //@―---------------------------------------------------------------------------
    inline ComPtr<ID3D12Device>& DeviceImpl::getNativeDevice() {
        return m_device;
    }


    //@―---------------------------------------------------------------------------
    //! @brief  ファクトリを取得
    //@―---------------------------------------------------------------------------
    inline ComPtr<IDXGIFactory4>& DeviceImpl::getFactory() {
        return m_dxgiFactory;
    }


    //@―---------------------------------------------------------------------------
    //! @brief  システム・コマンド・キューを取得
    //@―---------------------------------------------------------------------------
    inline ComPtr<ID3D12CommandQueue>& DeviceImpl::getCommandQueue() {
        return m_commandQueue;
    }


    //@―---------------------------------------------------------------------------
    //! @brief  システム・コマンド・リストを取得
    //@―---------------------------------------------------------------------------
    inline ComPtr<ID3D12GraphicsCommandList>& DeviceImpl::getSystemCommandList() {
        return m_systemCmdList;
    }

}// namespace ob::graphic::dx12