//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#include <Framework/Core/Core.h>
#include <Framework/Engine/Engine.h>
#include <Framework/Engine/IModule.h>
#include <Framework/Core/Misc/DateTime.h>

namespace ob::engine {

	//@―---------------------------------------------------------------------------
	//! @brief  コンストラクタ
	//@―---------------------------------------------------------------------------
	Engine::Engine() 
		:m_moduleManager(*this)
	{
		Logger::Instance();
	}

	//@―---------------------------------------------------------------------------
	//! @brief  デストラクタ
	//@―---------------------------------------------------------------------------
	Engine::~Engine() {

		LOG_INFO("[Shutdown OctbitEngine]");
	}


	//@―---------------------------------------------------------------------------
	//! @brief  更新
	//@―---------------------------------------------------------------------------
	bool Engine::update() {

		// モジュール更新
		m_moduleManager.visit(
			[](IModule& m) {
				m.update();
			}
		);

		return m_terminate;
	}

	//@―---------------------------------------------------------------------------
	//! @brief  停止要求
	//@―---------------------------------------------------------------------------
	void Engine::terminate() {
		m_terminate = true;
	}

}// namespace ob