//***********************************************************
//! @file
//! @brief		ディスプレイ情報
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief  ディスプレイ情報
    //@―---------------------------------------------------------------------------
    struct DisplayInfo {
        Size    size;           //!< ウィンドウサイズ
        f32     refleshRate;    //!< リフレッシュ・レート
        bool    hdrSupported;   //!< HDRをサポートしているか
    };


}// namespcae ob::graphic