//***********************************************************
//! @file
//! @brief		フェンス定義
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief      フェンス定義
    //@―---------------------------------------------------------------------------
    enum class FenceType :u32 {
        BinaryGpuToCpu, //!< コマンドキューからホストへの同期を実行
        BinaryGpuToGpu, //!< コマンドキューの実行間で同期を実行
        Timeline,       //!< 
    };


    //@―---------------------------------------------------------------------------
    //! @brief      フェンス・フラグ
    //@―---------------------------------------------------------------------------
    enum class FenceFlag :u32 {
        None                = get_bit(0),   //!< なし
        Shared              = get_bit(1),   //!< 別プロセスの同じアダプタで動作するデバイスへのフェンスの共有を許可
        SharedCrossAdapter  = get_bit(2),   //!< 異なるアダプタで動作するデバイスへのフェンスの共有を許可
    };

    //@―---------------------------------------------------------------------------
    //! @brief      フェンス・フラグ・セット
    //@―---------------------------------------------------------------------------
    using FenceFlags = BitFlags<FenceFlag>;


    //@―---------------------------------------------------------------------------
    //! @brief      フェンス・定義
    //@―---------------------------------------------------------------------------
    struct FenceDesc {
        FenceType type;     //!< タイプ
        u64 initialValue;   //!< 初期値
        FenceFlags flags;   //!< フラグ
    };

}// namespcae ob::graphic