//***********************************************************
//! @file
//! @brief		各プラットフォームのコンフィグ
//! @author		Gajumaru
//***********************************************************
#pragma once
#include "Discrimination.h"

#if defined(OS_WINDOWS)
#include "Platforms/Windows/Macro.h"

#elif defined(OS_LINUX)
#include "Platforms/Linux/Macro.h"

#else
#pragma error(OS_NAME"ではDefineの定義がありません")
#endif


//@―---------------------------------------------------------------------------
//! @brief		エントリーポイント
//@―---------------------------------------------------------------------------
#define ENTRY_POINT() ENTRY_POINT_IMPL()


//@―---------------------------------------------------------------------------
//! @brief		アライン付き宣言
//@―---------------------------------------------------------------------------
#define ALIGN_DECL(type,alignment) ALIGN_DECL_IMPL(type,alignment)


//@―---------------------------------------------------------------------------
//! @brief		アライン付き変数宣言
//@―---------------------------------------------------------------------------
#define ALIGN_VAR(var,alignment) ALIGN_VAR_IMPL(var,alignment)


//@―---------------------------------------------------------------------------
//! @brief		強制inline修飾子
//@―---------------------------------------------------------------------------
#define FINLINE FINLINE_IMPL


//@―---------------------------------------------------------------------------
//! @brief		restrict型修飾子
//! @details    RESTRICT で修飾されたポインターによっ てアドレス指定されたメモリーが
//!             変更された場合、他のポインターはそのメモリーをアクセスしないことをコ
//!             ンパイラーに伝える。最適化の機能のため、上記の制約を守らない場合プロ
//!             グラマの責任となる。
//!             ```
//!             void foo(s32 n, s32 * RESTRICT a, s32 * RESTRICT b, s32 * RESTRICT c){
//!                 int i;
//!                 for (i = 0; i < n; ++i)
//!                     a[i] = b[i] + c[i];
//!             }
//!             ```
//@―---------------------------------------------------------------------------
#define RESTRICT RESTRICT_IMPL


//@―---------------------------------------------------------------------------
//! @brief		ディレクトリ文字
//@―---------------------------------------------------------------------------
#define DIRECTORY_CHAR DIRECTORY_CHAR_IMPL


//@―---------------------------------------------------------------------------
//! @brief		ディレクトリ文字列
//@―---------------------------------------------------------------------------
#define DIRECTORY_STR DIRECTORY_STR_IMPL





//@―---------------------------------------------------------------------------
//! @brief		コンパイラ最適化オプション
//! @details    式が真であることが多い場合コンパイルが最適化される。
//@―---------------------------------------------------------------------------
#define LIKELY(expr) LIKELY_IMPL(expr)


//@―---------------------------------------------------------------------------
//! @brief		コンパイラ最適化オプション
//! @details	式が偽であることが多い場合コンパイルが最適化される 。
//@―---------------------------------------------------------------------------
#define UNLIKELY(expr) UNLIKELY_IMPL(expr)





//@―---------------------------------------------------------------------------
//! @brief		システムログ出力
//@―---------------------------------------------------------------------------
#define OUTPUT_DEBUG_LOG(msg) OUTPUT_DEBUG_LOG_IMPL(msg)


//@―---------------------------------------------------------------------------
//! @brief		特定のコード行にブレークポイントを設定する
//@―---------------------------------------------------------------------------
#define CALL_BREAK_POINT() CALL_BREAK_POINT_IMPL()


//@―---------------------------------------------------------------------------
//! @brief		DLL出力
//@―---------------------------------------------------------------------------
#define DLL_EXPORT DLL_EXPORT_IMPL


//@―---------------------------------------------------------------------------
//! @brief		DLL入力
//@―---------------------------------------------------------------------------
#define DLL_IMPORT DLL_IMPORT_IMPL


//@―---------------------------------------------------------------------------
//! @brief	関数名取得マクロ(詳細版)
//@―---------------------------------------------------------------------------
#define __FUNC_NAME__ __FUNC_NAME__IMPL