//***********************************************************
//! @file
//! @brief		機能サポート
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/RHI/Types/TextureFormat.h>
#include <dxgi.h>

namespace ob::rhi::dx12 {

    //@―---------------------------------------------------------------------------
    //! @brief  機能サポート
    //@―---------------------------------------------------------------------------
    class FeatureSurport {
    public:

    };

}// namespcae ob::rhi::dx12