//***********************************************************
//! @file
//! @brief		シェーダ実装(DirectX12)
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/RHI/IShader.h>
#include <Framework/Core/Misc/Blob.h>

//===============================================================
// 前方宣言
//===============================================================
namespace ob::rhi::vulkan {
    class DeviceImpl;
    class ITexture;
}


//===============================================================
// クラス定義
//===============================================================
namespace ob::rhi::vulkan {

    //@―---------------------------------------------------------------------------
    //! @brief  シェーダ実装(DirectX12)
    //@―---------------------------------------------------------------------------
    class ShaderImpl :public IShader {
    public:

        //===============================================================
        //	コンストラクタ
        //===============================================================

        //@―---------------------------------------------------------------------------
        //! @brief				シェーダーコードからシェーダーオブジェクトを生成
        //!
        //! @param src			シェーダコード
        //! @param stage		シェーダステージ
        //! @param errorDest	エラー出力先文字列
        //@―---------------------------------------------------------------------------
        ShaderImpl(VkDevice device, const String& code, ShaderStage stage);


        //@―---------------------------------------------------------------------------
        //! @brief				バイナリからシェーダーオブジェクトを生成
        //!
        //! @param src			バイナリ
        //! @param stage		シェーダステージ
        //! @param errorDest	エラー出力先文字列
        //@―---------------------------------------------------------------------------
        ShaderImpl(VkDevice device,const Blob & blob, ShaderStage stage);

        ~ShaderImpl();


        //@―---------------------------------------------------------------------------
        //! @brief  妥当な状態か
        //@―---------------------------------------------------------------------------
        bool isValid()const;


        //@―---------------------------------------------------------------------------
        //! @brief  シェーダステージを取得
        //@―---------------------------------------------------------------------------
        ShaderStage getStage()const override;

    public:

        //@―---------------------------------------------------------------------------
        //! @brief  コンパイル
        //@―---------------------------------------------------------------------------
        void compile(const StringBase<char>& blob,ShaderStage stage);

    private:

        void createShaderModule(BlobView blob, ShaderStage stage);

    private:

        ShaderStage         m_stage;                        //!< シェーダ・ステージ

        ::VkDevice          m_device=nullptr;
        ::VkShaderModule    m_shaderModule=nullptr;

    };

}// namespcae ob::rhi::dx12