//***********************************************************
//! @file
//! @brief		Graphicモジュール設定
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief      Graphicモジュール設定
    //@―---------------------------------------------------------------------------
    struct Settings {
        s32 frameBufferCount = 2;   //!< ダブルバッファリング
    };

}// namespace pb::graphic