//***********************************************************
//! @file
//! @brief		デバイス実装(Vulkan)
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/RHI/IDevice.h>
#include <Framework/RHI/Types/FeatureLevel.h>
#include <Framework/RHI/Types/DescriptorDesc.h>

//===============================================================
// クラス定義
//===============================================================
namespace ob::rhi::vulkan {

	class DeviceImpl :public IDevice {
	public:

		//===============================================================
		// コンストラクタ / デストラクタ
		//===============================================================

		//@―---------------------------------------------------------------------------
		//! @brief  コンストラクタ
		//@―---------------------------------------------------------------------------
		DeviceImpl(FeatureLevel featureLevel);
		~DeviceImpl();


		//@―---------------------------------------------------------------------------
		//! @brief  妥当な状態か
		//@―---------------------------------------------------------------------------
		bool isValid()const override;


		//===============================================================
		// 更新
		//===============================================================

		void entryCommandList(const class CommandList&) override;
		void update()override;


		//===============================================================
		// 生成
		//===============================================================

		//@―---------------------------------------------------------------------------
		//! @brief  レンダーパスを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IRenderPass* createRenderPass(const RenderPassDesc& desc)override;

		//@―---------------------------------------------------------------------------
		//! @brief  フレームバッファを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IFrameBuffer* createFrameBuffer(const FrameBufferDesc& desc)override;

		//@―---------------------------------------------------------------------------
		//! @brief  スワップ・チェーンを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IDisplay* createDisplay(const SwapchainDesc& desc)override;


		//@―---------------------------------------------------------------------------
		//! @brief  コマンドリスト生成
		//@―---------------------------------------------------------------------------
		ob::rhi::ICommandList* createCommandList(const CommandListDesc& desc)override;


		//@―---------------------------------------------------------------------------
		//! @brief  ルートシグネチャを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IRootSignature* createRootSignature(const RootSignatureDesc& desc)override;


		//@―---------------------------------------------------------------------------
		//! @brief  パイプラインステートを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IPipelineState* createPipelineState(const PipelineStateDesc& desc)override;


		//@―---------------------------------------------------------------------------
		//! @brief  テクスチャを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::ITexture* createTexture(const TextureDesc& desc)override;


		//@―---------------------------------------------------------------------------
		//! @brief  テクスチャを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::ITexture* createTexture(BlobView desc)override;


		//@―---------------------------------------------------------------------------
		//! @brief  レンダーターゲットを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IRenderTarget* createRenderTarget(const RenderTargetDesc& desc)override;


		//@―---------------------------------------------------------------------------
		//! @brief  バッファーを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IBuffer* createBuffer(const BufferDesc& desc) override;


		//@―---------------------------------------------------------------------------
		//! @brief  シェーダを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IShader* createShader(const String&, ShaderStage) override;


		//@―---------------------------------------------------------------------------
		//! @brief  シェーダを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IShader* createShader(const Blob&, ShaderStage) override;


		//@―---------------------------------------------------------------------------
		//! @brief  デスクリプタ・テーブルを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IDescriptorTable* createDescriptorTable(DescriptorHeapType type, s32 elementNum)override;


	private:

		void createInstance();
		void createPhysicalDevice();
		void createLogicalDevice();
		void createQueue();

	private:

		FeatureLevel		m_featureLevel;

		VkInstance			m_instance			= nullptr;
		VkPhysicalDevice	m_physicalDevice	= nullptr;
		VkDevice			m_logicalDevice		= nullptr;
		VkQueue				m_queue				= nullptr;
		VkCommandPool		m_commandPool		= nullptr;

		u32					m_queueFamilyIndex;
		u32					m_queueCount;

	};
}// namespace ob::rhi::dx12






//===============================================================
// インライン
//===============================================================
namespace ob::rhi::dx12 {

}// namespace ob::rhi::dx12