//***********************************************************
//! @file
//! @brief		コマンドリスト定義
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::rhi {

#pragma region Enum

    //@―---------------------------------------------------------------------------
    //! @brief  コマンドリスト・タイプ
    //@―---------------------------------------------------------------------------
    enum class CommandListType :u32 {
        Graphic,    //!< グラフィック
        Compute,    //!< コンピュート
        // Copy
        // VideoDecode
        // VideoProcess
        // ViewoEncode
    };

#pragma endregion

    //@―---------------------------------------------------------------------------
    //! @brief  コマンドリスト定義
    //@―---------------------------------------------------------------------------
    struct CommandListDesc{
        String			name;	//!< 名前
        CommandListType type;   //!< 種類
    };

}// namespcae ob::rhi