//***********************************************************
//! @file
//! @brief		テクスチャ・ディメンジョン・タイプ
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief  テクスチャ・ディメンジョン・タイプ
    //@―---------------------------------------------------------------------------
    enum class TextureDimension {
        Texture2D,          //!< 2Dテクスチャ
        Texture3D,          //!< 3Dテクスチャ
        Cube,               //!< キューブテクスチャ
        Texture2DArray,     //!< 2Dテクスチャ配列
        CubeArray,          //!< キューブテクスチャ配列
    };

}// namespace pb::graphic