//***********************************************************
//! @file
//! @brief		2Dテクスチャ
//! @author		Gajumaru
//***********************************************************
#pragma once
#include "Texture.h"

namespace ob {
    namespace graphic {

        namespace detail {
            class ITexture;
        }

        //@―---------------------------------------------------------------------------
        //! @brief  2Dテクスチャ
        //@―---------------------------------------------------------------------------
        class Texture2D:public Texture {
        public:

            //===============================================================
            // 生成/読み込み関数
            //===============================================================

            //@―---------------------------------------------------------------------------
            //! @brief  テクスチャの生成
            //@―---------------------------------------------------------------------------
            static Ref<Texture2D> create(s32 width, s32 height);

            //@―---------------------------------------------------------------------------
            //! @brief  テクスチャの生成
            //@―---------------------------------------------------------------------------
            static Ref<Texture2D> create(s32 width, s32 height, TextureFormat format);

            //@―---------------------------------------------------------------------------
            //! @brief  ファイルからテクスチャを読み込み
            //@―---------------------------------------------------------------------------
            static Ref<Texture2D> load(const StringView& filePath);

            //@―---------------------------------------------------------------------------
            //! @brief  ファイルからテクスチャを非同期読み込み
            //@―---------------------------------------------------------------------------
            static Ref<Texture2D> loadAsync(const StringView& filePath);

            static Texture2D* blackTexture();
            static Texture2D* whiteTexture();
            static Texture2D* normalTexture();
            static Texture2D* errorTexture();


        protected:

            Texture2D() = default;
            Texture2D(s32 width,s32 height,TextureFormat format);

            //@―---------------------------------------------------------------------------
            //! @brief  
            //@―---------------------------------------------------------------------------

        private:

            Ref<detail::ITexture> m_object;

        };

    }// namespace graphic
}// namespcae ob