//***********************************************************
//! @file
//! @brief		モジュール・インターフェイス
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Core/String/Name.h>

namespace ob::engine {

    class Engine;

    enum class ModuleType {
        Require,
        Either,
        Optional,
    };


    //@―---------------------------------------------------------------------------
    //! @brief      モジュール・インターフェイス
    //! 
    //! @details    スタートアップに依存のあるシステムをエンジンに追加するために使用します。
    //!             モジュールはデフォルト設定で起動する Engine& のみを引数に取るコンストラクタを持つようにしてください。
    //!             依存するモジュールはデフォルト設定で追加されますが、生成オプションを持たせる場合は 
    //@―---------------------------------------------------------------------------
    class IModule {
    public:

        // static void Create();

    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================

        //@―---------------------------------------------------------------------------
        //! @brief  説明
        //@―---------------------------------------------------------------------------
        IModule(Engine& engine) 
            : m_engine(engine)
        {
        }

        virtual void start() {}
        virtual void update(){}
        virtual void stop() {}

    private:

        Engine& m_engine;

    };



    //===============================================================
    // インライン関数
    //===============================================================
    //! @cond



    //! @endcond
}// namespcae ob