//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob
{
    //-----------------------------------------------------------------------------
    // ヒープ・タイプ
    //-----------------------------------------------------------------------------
    enum class HeapType
    {
        VirtualMemory = 0,            //!< 仮想メモリ
        CPUCached,              //!< CPU側キャッシュ

        GPUReadable,            //!< GPU読み込み
        GPUReadWritable,         //!< GPU読み書き

        Max
    };


    //-----------------------------------------------------------------------------
    // ヒープ・アルゴリズム
    //-----------------------------------------------------------------------------
    enum class HeapClass
    {
        OS,     // システムのnew/deleteによるメモリ確保
        Mimalloc,   // mimalloc
        TLSF,       // Two-Level Segregate Fit

        Invalid,    // 不正
    };


}// namespcae ob