//***********************************************************
//! @file
//! @brief		ヒープ・タイプ
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob
{
    //@―-------------------------------------------------------------------------------
    //! @brief ヒープ・タイプ
    //@―-------------------------------------------------------------------------------
    enum class HeapType
    {
        VirtualMemory = 0,            //!< 仮想メモリ
        CPUCached,              //!< CPU側キャッシュ

        GPUReadable,            //!< GPU読み込み
        GPUReadWritable,         //!< GPU読み書き

        Max
    };


    //@―-------------------------------------------------------------------------------
    //! @brief ヒープ・アルゴリズム
    //@―-------------------------------------------------------------------------------
    enum class HeapClass
    {
        System,     //!< システムのnew/deleteによるメモリ確保
        Mimalloc,   //!< mimalloc
        TLSF,       //!< Two-Level Segregate Fit

        Invalid,    //!< 不正
    };


}// namespcae ob