//***********************************************************
//! @file
//! @brief		バッファ
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Core/Misc/Blob.h>
#include <Framework/RHI/GraphicObject.h>
#include <Framework/RHI/Types/BufferDesc.h>

//===============================================================
// クラス宣言
//===============================================================
namespace ob::rhi {

	//@―---------------------------------------------------------------------------
	//! @brief      バッファ
	//@―---------------------------------------------------------------------------
	class Buffer :public GraphicObject {
	public:

		//@―---------------------------------------------------------------------------
		//! @brief  コンストラクタ
		//! 
		//! @param desc バッファ定義
		//! @param name 名前
		//@―---------------------------------------------------------------------------
		static Ref<Buffer> Create(const BufferDesc& desc);


		//@―---------------------------------------------------------------------------
		//! @brief  コンストラクタ
		//! 
		//! @param desc バッファ定義
		//! @param blob 初期化データ
		//! @param name 名前
		//@―---------------------------------------------------------------------------
		static Ref<Buffer> Create(const BufferDesc& desc, BlobView blob);

	public:

		//@―---------------------------------------------------------------------------
		//! @brief  定義を取得
		//@―---------------------------------------------------------------------------
		virtual const BufferDesc& getDesc()const = 0;


		//@―---------------------------------------------------------------------------
		//! @brief      バッファを更新
		//! 
		//! @details    map / unmap と異なり、バッファの更新は描画スレッドの直前にまとめて行われます。
		//@―---------------------------------------------------------------------------
		virtual void update(size_t size, const void* pData, size_t offset = 0) = 0;


		//@―---------------------------------------------------------------------------
		//! @brief      バッファを更新(直接更新)
		//! 
		//! @details    map / unmap と異なり、バッファの更新は描画スレッドの直前にまとめて行われます。
		//@―---------------------------------------------------------------------------
		virtual void updateDirect(size_t size, const void* pData, size_t offset = 0) = 0;


		//@―---------------------------------------------------------------------------
		//! @brief      バッファを更新(直接更新)
		//@―---------------------------------------------------------------------------
		template<class T>
		void updateDirect(const T& value, size_t offset = 0) {
			updateDirect(sizeof(T), &value, offset);
		}

	};

}// namespace pb::rhi