//***********************************************************
//! @file
//! @brief		レンダーパス
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/RHI/GraphicObject.h>
#include <Framework/RHI/Types/RenderPassDesc.h>
#include <Framework/RHI/Types/RenderPassDescHelper.h>

//===============================================================
// クラス宣言
//===============================================================
namespace ob::rhi {

    //@―---------------------------------------------------------------------------
    //! @brief      レンダーパス
    //@―---------------------------------------------------------------------------
    class RenderPass :public GraphicObject {
    public:

        //@―---------------------------------------------------------------------------
        //! @brief  生成
        //@―---------------------------------------------------------------------------
        static Ref<RenderPass> Create(const RenderPassDesc& desc);

    public:

        //@―---------------------------------------------------------------------------
        //! @brief  定義取得
        //@―---------------------------------------------------------------------------
        virtual const RenderPassDesc& desc()const = 0;

    protected:

        virtual ~RenderPass() = default;

    };

}// namespace pb::rhi