//***********************************************************
//! @file
//! @brief		パイプラインステート
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/RHI/Utility/GraphicObjectHolder.h>
#include <Framework/RHI/Types/RenderPassDesc.h>
#include <Framework/RHI/Types/RenderPassDescHelper.h>

namespace ob::rhi {

    //@―---------------------------------------------------------------------------
    //! @brief  パイプラインステート
    //@―---------------------------------------------------------------------------
    class RenderPass {
        OB_DEFINE_GRAPHIC_OBJECT_HOLDER(RenderPass);
    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================

        //@―---------------------------------------------------------------------------
        //! @brief  コンストラクタ
        //@―---------------------------------------------------------------------------
        RenderPass();


        //@―---------------------------------------------------------------------------
        //! @brief  デストラクタ
        //@―---------------------------------------------------------------------------
        RenderPass(const RenderPassDesc& desc);

        const RenderPassDesc& desc()const;

    };

}// namespcae ob::rhi