//***********************************************************
//! @file
//! @brief		ルートシグネチャ・インターフェイス
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/RHI/GraphicObject.h>
#include <Framework/RHI/Types/RootSignatureDesc.h>

//===============================================================
// クラス宣言
//===============================================================
namespace ob::rhi {

    //@―---------------------------------------------------------------------------
    //! @brief      ルートシグネチャ・インターフェイス
    //@―---------------------------------------------------------------------------
    class RootSignature :public GraphicObject {
    public:
        
        //@―---------------------------------------------------------------------------
        //! @brief  生成
        //@―---------------------------------------------------------------------------
        static Ref<RootSignature> Create(const RootSignatureDesc& desc);

    public:

        //@―---------------------------------------------------------------------------
        //! @brief      定義を取得
        //@―---------------------------------------------------------------------------
        virtual const RootSignatureDesc& getDesc()const = 0;
        /*
        //@―---------------------------------------------------------------------------
        //! @brief      ルートシグネチャに対応するディスクリプタプール、セットを作成するのに必要なプールサイズを取得。
        //!
        //! @param[out]
        //@―---------------------------------------------------------------------------
        virtual const u32& getDescriptorPoolSizes(s32 desc)const = 0;
        */

    protected:

        virtual ~RootSignature() = default;
    };

}// namespace pb::rhi