//***********************************************************
//! @file
//! @brief		RHI・モジュール
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/RHI/Forward.h>
#include <Framework/RHI/GraphicObjectManager.h>

namespace ob::rhi {

	//@―---------------------------------------------------------------------------
	//! @brief      RHI・モジュール
	//! 
	//! @details    RHIのモジュール基底です。
	//!             DirectXやVulkanなど、APIを共通化する場合はこのモジュール・インターフェースを実装して下さい。
    //@―---------------------------------------------------------------------------
	class RHIModule {
	public:

		//@―---------------------------------------------------------------------------
		//! @brief      デバイス生成
		//@―---------------------------------------------------------------------------
		virtual Device* getDevice() = 0;

		//@―---------------------------------------------------------------------------
		//! @brief      
		//@―---------------------------------------------------------------------------
		virtual GraphicObjectManager& getObjectManager() = 0;

	};

}// namespace pb::rhi