//***********************************************************
//! @file
//! @brief		カーソルタイプ型
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob {
    namespace platform {

        //@―---------------------------------------------------------------------------
        //! @brief  カーソルタイプ
        //@―---------------------------------------------------------------------------
        enum class CursorType {
            Arrow,
        };

    }// namespace platform
}// namespcae ob