//***********************************************************
//! @file
//! @brief		範囲
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Core/CoreTypes.h>

namespace ob::core {

	//@―---------------------------------------------------------------------------
	//! @brief      範囲
	//@―---------------------------------------------------------------------------
	struct OB_API Range {
	public:

		//===============================================================
		//  コンストラクタ / デストラクタ
		//===============================================================

		//@―---------------------------------------------------------------------------
		//! @brief デフォルトコンストラクタ(初期化なし)
		//@―---------------------------------------------------------------------------
		Range()noexcept = default;


		//@―---------------------------------------------------------------------------
		//! @brief コンストラクタ(Identityで初期化)
		//@―---------------------------------------------------------------------------
		explicit Range(EForceInit)noexcept
			:Range(0.f, 0.f)
		{}


		//@―---------------------------------------------------------------------------
		//! @brief		コンストラクタ(範囲指定)
		//! 
		//! @param min  最小値
		//! @param max  最大値
		//@―---------------------------------------------------------------------------
		Range(f32 min, f32 max)noexcept
			:min(min), max(max)
		{}


		//@―---------------------------------------------------------------------------
		//! @brief		[min,max]がvalueを含むか
		//@―---------------------------------------------------------------------------
		bool contains(f32 value)const noexcept
		{
			return min < value&& value < max;
		}


		//@―---------------------------------------------------------------------------
		//! @brief		(min,max)がvalueを含むか
		//@―---------------------------------------------------------------------------
		bool containsOO(f32 value)const noexcept
		{
			return min <= value && value <= max;
		}


		//@―---------------------------------------------------------------------------
		//! @brief		[min,max)がvalueを含むか
		//@―---------------------------------------------------------------------------
		bool containsCO(f32 value)const noexcept
		{
			return min < value&& value <= max;
		}


		//@―---------------------------------------------------------------------------
		//! @brief		(min,max]がvalueを含むか
		//@―---------------------------------------------------------------------------
		bool containsOC(f32 value)const noexcept
		{
			return min <= value&& value < max;
		}

	public:

		f32 min;	//!< 最小値
		f32 max;	//!< 最大値

	};

}// namespcae ob


//===============================================================
// フォーマット
//===============================================================
//! @cond
template <> struct fmt::formatter<ob::core::Range, ob::core::Char> {
	template<typename ParseContext>
	constexpr auto parse(ParseContext& ctx) -> decltype(ctx.begin()) {
		return ctx.end();
	}

	template<typename FormatContext>
	auto format(ob::core::Range value, FormatContext& ctx) -> decltype(ctx.out()) {
		return format_to(ctx.out(), TC("({:.5},{:.5})"), value.min,value.max);
	}
};
//! @endcond