//***********************************************************
//! @file
//! @brief		
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/RHI/Forward.h>
#include <Framework/Graphics/Forward.h>
#include <Framework/Core/Utility/Swapper.h>
#include <Framework/Core/Utility/HandleManager.h>

#include <Framework/Graphics/FrameGraph/FGResourcePool.h>
#include <Framework/Graphics/FrameGraph/FG.h>


namespace ob::graphics {

    class MaterialManager;

    //@―---------------------------------------------------------------------------
    //! @brief      システムをServiceInjectorに登録
    //@―---------------------------------------------------------------------------
    void Register(ServiceInjector&);

    //@―---------------------------------------------------------------------------
    //! @brief      グラフィック
    //@―---------------------------------------------------------------------------
    class Graphics :public Singleton<Graphics> {
    public:

        //@―---------------------------------------------------------------------------
        //! @brief      コンストラクタ
        //@―---------------------------------------------------------------------------
        Graphics(rhi::RHI& rhi, MaterialManager&);

        //@―---------------------------------------------------------------------------
        //! @brief      デストラクタ
        //@―---------------------------------------------------------------------------
        ~Graphics();

        //@―---------------------------------------------------------------------------
        //! @brief      ゲームループごとの更新を実行する
        //@―---------------------------------------------------------------------------
        void update();

        void beginForParallel(s32 threadNum);
        void updateForParallel(s32 threadIndex);


        //@―---------------------------------------------------------------------------
        //! @brief      ネイティブの描画コマンドを発行して描画処理を開始する
        //@―---------------------------------------------------------------------------
        void execute();

        //@―---------------------------------------------------------------------------
        //! @brief      ネイティブの描画コマンドを発行して描画処理を開始する
        //@―---------------------------------------------------------------------------
        void wait();

        //@―---------------------------------------------------------------------------
        //! @brief      シーンを追加
        //! @note       追加したシーンはGraphicsの終了までに removeScene で削除される必要があります。
        //@―---------------------------------------------------------------------------
        void addScene(RenderScene* scene);

        //@―---------------------------------------------------------------------------
        //! @brief      シーンを削除
        //@―---------------------------------------------------------------------------
        void removeScene(RenderScene* scene);

        FGData getFGData()const;
    private:

        rhi::RHI& m_rhi;

        UPtr<FG> m_fg{ nullptr };

        Swapper<Ref<rhi::CommandList>> m_commandLists;

        FGResourcePool m_fgResourcePool;

        Array<RenderScene*> m_scenes;
    };

}