//***********************************************************
//! @file
//! @brief		ファイルタイプ
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Core/CorePrivate.h>

namespace ob::core {

	//@―---------------------------------------------------------------------------
	//! @brief  シーク基準
	//@―---------------------------------------------------------------------------
	enum class SeekOrigin {
		Begin,
		Current,
		End,
	};

	//@―---------------------------------------------------------------------------
	//! @brief  ファイル属性
	//@―---------------------------------------------------------------------------
	enum class FileAttribut :u32
	{
		None = get_bit(0),	//!< なし
		Normal = get_bit(1),	//!< 通常ファイル
		Directory = get_bit(2),	//!< ディレクトリ
		ReadOnly = get_bit(3),	//!< 読み取り専用
		Hidden = get_bit(4),	//!< 隠しファイル
	};

	//@―---------------------------------------------------------------------------
	//! @brief  ファイル・オープン・モード
	//@―---------------------------------------------------------------------------
	enum class FileOpenMode :u32
	{
		Read = get_bit(0),	//!< 読み取り
		Write = get_bit(1),	//!< 書き込み
		Append = get_bit(2),	//!< 追記

		Text = get_bit(3),
	};

}