//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <filesystem>
#include <Framework/Core/String/String.h>
#include <Framework/Core/String/Format.h>
#include <Framework/Core/Misc/YesNo.h>

namespace ob::core {
	
	DEFINE_YES_NO(WithDot);

	//@―---------------------------------------------------------------------------
	//! @brief		ファイルパスのユーティリティ
	//@―---------------------------------------------------------------------------
	class Path {
	public:

		//@―---------------------------------------------------------------------------
		//! @brief		複数の文字列を結合してPath文字列に変換する。
		//@―---------------------------------------------------------------------------
		template<class... TArgs>
		static String Combine(TArgs&&... args) { return String((std::filesystem::path(std::string_view(args)) / ...).u8string()).replace('\\',Separator()); }

		//@―---------------------------------------------------------------------------
		//! @brief		区切り文字を取得
		//@―---------------------------------------------------------------------------
		static Char Separator();

		//@―---------------------------------------------------------------------------
		//! @brief		パス文字列を正規化する
		//! @detailas	* lexically_normalを使用して正規化
		//!				* 区切り文字を/に統一
		//@―---------------------------------------------------------------------------
		static String Normalize(StringView path);

		//@―---------------------------------------------------------------------------
		//! @brief		ファイルパスからファイル名を取得
		//! @details	StemとExtensionを結合したものを返します。
		//!				例：sample.txt
		//@―---------------------------------------------------------------------------
		static String FileName(StringView path);

		//@―---------------------------------------------------------------------------
		//! @brief		ファイルパスからStemを取得
		//! @details	拡張子を除いたファイル名を返します。
		//!				例：sample
		//@―---------------------------------------------------------------------------
		static String Stem(StringView path);

		//@―---------------------------------------------------------------------------
		//! @brief		ファイルパスから拡張子を取得
		//! @param		withDot	ドットを含めるか
		//! @details	例：.txt / txt
		//@―---------------------------------------------------------------------------
		static String Extension(StringView path, WithDot withDot = WithDot::No);

		//@―---------------------------------------------------------------------------
		//! @brief		ファイルパスから親ディレクトリを取得
		//@―---------------------------------------------------------------------------
		static String Parent(StringView path, s32 level);

		//@―---------------------------------------------------------------------------
		//! @brief		ファイルパスが絶対パスか
		//! @details	Windowsの場合、ドライブ名か//から始まる場合trueを返します。
		//@―---------------------------------------------------------------------------
		static bool IsAbsolute(StringView path);

		//@―---------------------------------------------------------------------------
		//! @brief		ファイルパスが相対パスか
		//! @details	絶対パスではない場合trueを返します。
		//@―---------------------------------------------------------------------------
		static bool IsRelative(StringView path);

		//@―---------------------------------------------------------------------------
		//! @brief		ファイルパスが拡張子を持つか
		//! @details	extに拡張子を指定した場合は対象の拡張子を持つか判定します。
		//@―---------------------------------------------------------------------------
		static bool HasExtension(StringView path, StringView ext = "");

		//@―---------------------------------------------------------------------------
		//! @brief		ファイルパスの拡張子を変更
		//! @details	ファイルパスが拡張子を持たない場合はfalseを返します。
		//@―---------------------------------------------------------------------------
		static String ReplaceExtension(StringView path, StringView extension);

		//@―---------------------------------------------------------------------------
		//! @brief		ファイルパスのステムを変更
		//@―---------------------------------------------------------------------------
		static String ReplaceStem(StringView path, StringView stem);

		//@―---------------------------------------------------------------------------
		//! @brief		ファイルパスのファイル名を変更
		//@―---------------------------------------------------------------------------
		static String ReplaceFileName(StringView path, StringView fileName);

		//@―---------------------------------------------------------------------------
		//! @brief		ファイルパスの拡張子を削除
		//@―---------------------------------------------------------------------------
		static String RemoveExtension(StringView path);

		//@―---------------------------------------------------------------------------
		//! @brief		ファイルパスのファイル名を削除
		//@―---------------------------------------------------------------------------
		static String RemoveFileName(StringView path);

	};

}