//***********************************************************
//! @file
//! @brief		時間/日時型
//! @author		Gajumaru
//***********************************************************
#pragma once
namespace ob::platform {


    //@―---------------------------------------------------------------------------
    //! @brief  曜日
    //@―---------------------------------------------------------------------------
    enum class DayOfWeek {
        Sunday,     //!< 日曜日
        Monday,     //!< 月曜日 
        Tuesday,    //!< 火曜日
        Wednesday,  //!< 水曜日
        Thursday,   //!< 木曜日
        Friday,     //!< 金曜日
        Saturday,   //!< 土曜日
    };


    //@―---------------------------------------------------------------------------
    //! @brief  日時型
    //@―---------------------------------------------------------------------------
    struct Date {
        s32 year;               //!< 年
        s32 month;              //!< 月
        DayOfWeek dayOfWeek;    //!< 曜日
        s32 day;                //!< 日
        s32 hour;               //!< 時間
        s32 minute;             //!< 分
        s32 second;             //!< 秒
        s32 milliseconds;       //!< ミリ秒
    };

}// namespace ob::platform