//***********************************************************
//! @file
//! @brief		コマンドキュー実装(DirectX12)
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Interface/ICommandList.h>

namespace ob::graphic::dx12 {

    //@―---------------------------------------------------------------------------
    //! @brief      コマンドキュー実装(DirectX12)
    //! 
    //! @details    コマンドキューは複数のコマンドリストをGPUに送信するために使用されます。
    //!             コマンドリストは非スレッドセーフのため、スレッドごとに構築された
    //!             コマンドリストをまとめるために使用されます。
    //@―---------------------------------------------------------------------------
    class CommandListImpl {
    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================

        //@―---------------------------------------------------------------------------
        //! @brief  説明
        //@―---------------------------------------------------------------------------

    private:



    };

}// ob::graphic::dx12 