//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphics/Forward.h>

namespace ob::graphics {

	//@―---------------------------------------------------------------------------
	//! @brief      描画ステップ
	//! @detailas   カメラごとに持ちます。
	//@―---------------------------------------------------------------------------
	class RenderPipeline {
	public:

		virtual ~RenderPipeline() = default;

		//@―---------------------------------------------------------------------------
		//! @brief      描画
		//@―---------------------------------------------------------------------------
		virtual void render(CommandRecorder&) {};

		//@―---------------------------------------------------------------------------
		//! @brief      ビューを生成
		//@―---------------------------------------------------------------------------
		virtual UPtr<RenderView> createView() = 0;

	public:

		//@―---------------------------------------------------------------------------
		//! @brief      所属シーンを取得する
		//@―---------------------------------------------------------------------------
		RenderScene& getScene()const { return m_scene; }

	protected:
		RenderPipeline(RenderScene& scene) :m_scene(scene) {}
	private:
		RenderScene& m_scene;
	};

}