//***********************************************************
//! @file
//! @brief		フェンス
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Types/FenceDesc.h>
#include <Framework/Graphic/Types/Result.h>

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief      CPUとGPUの同期オブジェクト
    //@―---------------------------------------------------------------------------
    class IFence {
    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================

        //@―---------------------------------------------------------------------------
        //! @brief  定義を取得
        //@―---------------------------------------------------------------------------
        virtual FenceDesc& getDesc()const = 0;


        //@―---------------------------------------------------------------------------
        //! @brief      リセット
        //! 
        //! @details    
        //@―---------------------------------------------------------------------------
        virtual Result reset() = 0;


        //@―---------------------------------------------------------------------------
        //! @brief      指定のシグナル値になるか、シグナルされるまで待機。
        //! 
        //! @details    
        //! @param value    待機するシグナル値
        //! @param timeout  タイムアウトするまでのミリ秒
        //! @retval Result::Success 成功
        //! @retval Result::Timeout タイムアウト
        //! @retval Result::DeviceRemoved デバイスが削除された
        //@―---------------------------------------------------------------------------
        virtual Result wait(u64 value,u32 timeout) = 0;


        //@―---------------------------------------------------------------------------
        //! @brief          シグナル値を設定
        //! 
        //! @param value    シグナル値。シグナル予定のフェンス値より大きくしてください。
        //@―---------------------------------------------------------------------------
        virtual bool signal(u64 value) = 0;

    };

}// namespcae ob::graphic