//***********************************************************
//! @file
//! @brief		フレームバッファ・インターフェイス
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Interface/GraphicObject.h>


//===============================================================
// クラス宣言
//===============================================================
namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief      フレームバッファ・インターフェイス
    //@―---------------------------------------------------------------------------
    class IFrameBuffer :public GraphicObject {
    public:

        //@―---------------------------------------------------------------------------
        //! @brief  妥当な状態か
        //@―---------------------------------------------------------------------------
        virtual bool isValid()const = 0;


    protected:

        virtual ~IFrameBuffer() = default;

    };

}// namespace pb::graphic