//***********************************************************
//! @file
//! @brief		レンダー・テクスチャ・インターフェイス
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Interface/ITexture.h>

//===============================================================
// 前方宣言
//===============================================================
namespace ob::graphic {
}

//===============================================================
// クラス宣言
//===============================================================
namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief      レンダー・テクスチャ・インターフェイス
    //@―---------------------------------------------------------------------------
    class IRenderTexture :public GraphicObject {
    public:

    protected:

        virtual ~IRenderTexture()=default;

    };

}// namespace pb::graphic