//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Input/InputType.h>

namespace ob::input {

    //@―---------------------------------------------------------------------------
    //! @brief  説明
    //@―---------------------------------------------------------------------------
    class InputManager:public Singleton<InputManager> {
    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================
        InputManager();
        ~InputManager();

        //@―---------------------------------------------------------------------------
        //! @brief  説明
        //@―---------------------------------------------------------------------------
        void update();


        bool Down(Key);				// 押している間

        // Keyboard& getKeyboard();
        // Mouse& getMouse();

    public:

        Pimpl<class KeyboardImpl> m_impl;
        Pimpl<class MouseImpl> m_mouse;

    };

}// namespcae ob