//***********************************************************
//! @file
//! @brief		ブレンド・オペレータ
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief      ブレンド・オペレータ
    //! 
    //! @details    ピクセルシェーダが出力するRGBまたはAのレンダーターゲットへのブレンド方法です。
    //! @see        BlendState    
    //@―---------------------------------------------------------------------------
    enum class BlendOp :u32 {
        Add,        //!< A+B
        Sub,        //!< A-B
        RevSub,     //!< B-A
        Min,        //!< min(A,B)
        Max,        //!< max(A,B)
    };

}// namespcae ob::graphic