//***********************************************************
//! @file
//! @brief		バッファ・タイプ
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief  バッファ・タイプ
    //@―---------------------------------------------------------------------------
    enum class BufferType {
        ByteAddressBuffer,  //!< バイトアドレス・バッファ
        ConstanttBuffer,    //!< 定数バッファ
        StructuredBuffer,   //!< 構造体バッファ
        IndexBuffer,        //!< インデックスバッファ
        VertexBuffer,       //!< 頂点バッファ
    };

}// namespcae ob::graphic