//***********************************************************
//! @file
//! @brief		コマンドリスト・タイプ
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief  コマンドリスト・タイプ
    //@―---------------------------------------------------------------------------
    enum class CommandListType{
        Unknown,    //!< 不明
        Graphic,    //!< グラフィック
        Compute,    //!< コンピュート
    };

}// namespcae ob::graphic