//***********************************************************
//! @file
//! @brief		比較関数
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::graphic {

	//@―---------------------------------------------------------------------------
	//! @brief      比較関数 
	//@―---------------------------------------------------------------------------
	enum class ComparisonFunc :u32 {
		Never,			//!< 必ず失敗
		Always,			//!< 常に成功
		Equal,			//!< ソースとデストが等しい場合成功
		NotEqual,		//!< ソースがデストと異なる場合成功
		Less,			//!< ソースがデストより小さい場合成功
		Greater,		//!< ソースがデストより大きい場合成功
		LessEqual,		//!< ソースがデスト以下の場合成功
		GreaterEqual,	//!< ソースがデスト以上の場合成功
	};

}// namespcae ob::graphic