//***********************************************************
//! @file
//! @brief		フィル・モード
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::graphic {

	//@―---------------------------------------------------------------------------
	//! @brief      フィル・モード
	//@―---------------------------------------------------------------------------
	enum class FillMode :u32 {
		Solid,		//<! 前面塗りつぶし
		Wireframe,	//<! ワイヤーフレーム
		Point,		//<! ポイント
	};

}// namespcae ob::graphic