//***********************************************************
//! @file
//! @brief		ラスタライズ定義
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::graphic {

	//@―---------------------------------------------------------------------------
	//! @brief      フィル・モード
	//! 
	//! @details	ポリゴン描画時にどこを塗りつぶすか
	//@―---------------------------------------------------------------------------
	enum class FillMode :u32 {
		Solid,		//<! 全面
		Wireframe,	//<! 辺のみ
		Point,		//<! 頂点のみ
	};


	//@―---------------------------------------------------------------------------
	//! @brief      カリング方法
	//@―---------------------------------------------------------------------------
	enum class CullMode :u32 {
		None,		//!< なし
		Front,		//!< 前面を非表示
		Back,		//!< 背面を非表示 
	};


	//@―---------------------------------------------------------------------------
	//! @brief      ラスタライズ定義
	//@―---------------------------------------------------------------------------
	struct RasterizerDesc{
		FillMode fillMode{ FillMode::Solid };	//!< フィル・モード
		CullMode cullMode{ CullMode::Back };	//!< カリング方法
	};

}// namespcae ob::graphic