//***********************************************************
//! @file
//! @brief		シェーダ・タイプ
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief  シェーダ・タイプ
    //@―---------------------------------------------------------------------------
    enum class ShaderType {
        Vertex,             //!< 頂点シェーダ        
        Pixel,              //!< ピクセルシェーダ
        Geometory,          //!< ジオメトリシェーダ
        Hull,               //!< ハルシェーダ
        Domain,             //!< ドメインシェーダ
        Compute,            //!< コンピュートシェーダ
        Raygen,             //!< レイ生成シェーダ
        Closest,            //!< Closestシェーダ
        AnyHit,             //!< AnyHitシェーダ
        Intersection,       //!< Intersectionシェーダ
        Miss,               //!< ミスシェーダ
    };

}// namespace pb::graphic