//***********************************************************
//! @file
//! @brief		シェーダ・タイプ
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Core/Misc/Blob.h>

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief  シェーダ・タイプ
    //@―---------------------------------------------------------------------------
    enum class ShaderType {
        Vertex,             //!< 頂点シェーダ        
        Pixel,              //!< ピクセルシェーダ
        Geometory,          //!< ジオメトリシェーダ
        Hull,               //!< ハルシェーダ
        Domain,             //!< ドメインシェーダ
        Compute,            //!< コンピュートシェーダ
        Raygen,             //!< レイ生成シェーダ
        Closest,            //!< Closestシェーダ
        AnyHit,             //!< AnyHitシェーダ
        Intersection,       //!< Intersectionシェーダ
        Miss,               //!< ミスシェーダ
    };


    //@―---------------------------------------------------------------------------
    //! @brief      シェーダのバイナリセット
    //! 
    //! @details    実行環境によって使用できるシェーダ言語が異なります。
    //!             |DirectX|Vulkan|
    //!             |-------|------|
    //!             |HLSL   |GLSL  |
    //!             シェーダのエントリー関数は固定です。
    //!             |Vertex|Pixel |
    //!             |------|------|
    //!             |VSMain|PSMain|
    //@―---------------------------------------------------------------------------
    struct ShaderBinarySet {
        Blob vs;
        Blob ps;
    };


    //@―---------------------------------------------------------------------------
    //! @brief      シェーダのコードセット
    //! 
    //! @details    実行環境によって使用できるシェーダ言語が異なります。
    //!             |DirectX|Vulkan|
    //!             |-------|------|
    //!             |HLSL   |GLSL  |
    //!             シェーダのエントリー関数は固定です。
    //!             |Vertex|Pixel |
    //!             |------|------|
    //!             |VSMain|PSMain|
    //@―---------------------------------------------------------------------------
    struct ShaderCodeSet {
        String code;
        bool useVS;
        bool usePS;
    };


}// namespace pb::graphic