//***********************************************************
//! @file
//! @brief		テクスチャ・ラップ・モード
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief  テクスチャ・ラップ・モード
    //@―---------------------------------------------------------------------------
    enum class TextureWrapMode {
        Repeat, //!< 繰り返し
        Clamp,  //!< テクスチャの境界でクランプ
        Mirror, //!< テクスチャの境界でミラーリングして繰り返し
    };

}// namespcae ob::graphic