//***********************************************************
//! @file
//! @brief		テクスチャ・タイプ
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief  テクスチャ・タイプ
    //@―---------------------------------------------------------------------------
    enum class TextureType {
        Texture1D,          //!< 1Dテクスチャ
        Texture2D,          //!< 2Dテクスチャ
        Texture3D,          //!< 3Dテクスチャ
        Cube,               //!< キューブテクスチャ
    };

}// namespace pb::graphic