//***********************************************************
//! @file
//! @brief		ピクセル・フォーマット
//! @author		Gajumaru
//***********************************************************
#pragma once

namespace ob {
    namespace graphic {

        //@―---------------------------------------------------------------------------
        //! @brief  ピクセル・フォーマット
        //@―---------------------------------------------------------------------------
        enum class PixelFormtat :u8 {
            Auto,
            RGBA32,
            RGBA8,
            RGB32,
            RGB8,
            RG32,
            RG8,
            R32,
            R8,
            Alpha32 = R32,
            Alpha8 = R8,
        };

    }// namespace graphic
}// namespcae ob