//***********************************************************
//! @file
//! @brief		ビルド設定
//! @author		Gajumaru
//***********************************************************
#pragma once
//! @cond

//===============================================================
// ビルドオプション
//===============================================================

#define OB_ENABLE_LOG_FATAL
#define OB_ENABLE_LOG_ERROR
#define OB_ENABLE_LOG_WARNING
#define OB_ENABLE_LOG_INFO


//===============================================================
// プラットフォーム毎の定義で置き換え
//===============================================================
#include "Platform/PlatformConfig.h"

//! @endcond