//***********************************************************
//! @file
//! @brief		入力マネージャ
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Input/Interface/IInputDevice.h>

namespace ob::input {

    //@―---------------------------------------------------------------------------
    //! @brief  説明
    //@―---------------------------------------------------------------------------
    class InputManager:public Singleton<InputManager> {
    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================
        InputManager();
        ~InputManager();

        //@―---------------------------------------------------------------------------
        //! @brief  説明
        //@―---------------------------------------------------------------------------
        void update();

        IInputDevice* findDevice(DeviceID id,u32 user);

    public:

        Pimpl<class InputManagerImpl> m_impl;

    };

}// namespcae ob