//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Runtime/Graphic/Public/Texture/TextureDesc.h>
#include <Runtime/Graphic/Public/Texture/TextureFormat.h>

namespace ob {
    namespace graphic {


            //@―---------------------------------------------------------------------------
            //! @brief  テクスチャ・インターフェイス
            //@―---------------------------------------------------------------------------
            class ITexture :public RefObject {
            public:

                //@―---------------------------------------------------------------------------
                //! @brief  サイズの取得
                //@―---------------------------------------------------------------------------
                virtual IntVec2 size()const noexcept = 0;

                //@―---------------------------------------------------------------------------
                //! @brief  テクスチャフォーマットの取得
                //@―---------------------------------------------------------------------------
                virtual TextureFormat getFormat()const = 0;

                //@―---------------------------------------------------------------------------
                //! @brief  ミップマップを持っているか
                //@―---------------------------------------------------------------------------
                virtual bool isMipped()const noexcept = 0;

                //@―---------------------------------------------------------------------------
                //! @brief  sRGBフォーマット化
                //@―---------------------------------------------------------------------------
                virtual bool isSRGB()const noexcept = 0;


            };

    }// namespace graphic
}// namespcae ob