//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Module/IGraphicModule.h>
#include <Framework/Graphic/Texture/ITexture.h>

namespace ob::graphic {


    //@―---------------------------------------------------------------------------
    //! @brief  グラフィックAPIタイプ
    //@―---------------------------------------------------------------------------
    enum class GraphicAPI {
        D3D12,      //!< Direct3D 12
        Vulkan,     //!< Vulkan
    };

    //@―---------------------------------------------------------------------------
    //! @brief  説明
    //@―---------------------------------------------------------------------------
    class GraphicModule :public Singleton<GraphicModule> {
    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================

        //@―---------------------------------------------------------------------------
        //! @brief              コンストラクタ
        //! 
        //! @param graphicAPI   使用するグラフィックAPI
        //@―---------------------------------------------------------------------------
        GraphicModule(GraphicAPI graphicAPI);
        ~GraphicModule();

        Ref<ITexture> CreateTexture();

    private:

        std::unique_ptr<IGraphicModule> m_module;

    };






    //===============================================================
    // インライン関数
    //===============================================================
    //! @cond



    //! @endcond
}// namespace pb::graphic