//***********************************************************
//! @file
//! @brief		パイプラインステート
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Utility/GraphicObjectHolder.h>
#include <Framework/Graphic/Types/PipelineStateDesc.h>

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief  パイプラインステート
    //@―---------------------------------------------------------------------------
    class PipelineState {
        friend class Device;
        OB_DEFINE_GRAPHIC_OBJECT_HOLDER(PipelineState);
    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================

        //@―---------------------------------------------------------------------------
        //! @brief  コンストラクタ
        //@―---------------------------------------------------------------------------
        PipelineState();


        //@―---------------------------------------------------------------------------
        //! @brief  デストラクタ
        //@―---------------------------------------------------------------------------
        PipelineState(const PipelineStateDesc& desc, StringView name = TC("PipelineState"));


    };






    //===============================================================
    // インライン関数
    //===============================================================
    //! @cond



    //! @endcond
}// namespcae ob::graphic