//***********************************************************
//! @file
//! @brief		レンダーテクスチャ
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Utility/GraphicObjectHolder.h>
#include <Framework/Graphic/Texture.h>

//===============================================================
// 前方宣言
//===============================================================
namespace ob::graphic {
    class Device;
    class SwapChain;
    class Texture;
    class IRenderTexture;
}


//===============================================================
// クラス宣言
//===============================================================
namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief  説明
    //@―---------------------------------------------------------------------------
    class RenderTexture {
        friend Device;
        friend SwapChain;
        OB_DEFINE_GRAPHIC_OBJECT_HOLDER(RenderTexture);
    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================

        //@―---------------------------------------------------------------------------
        //! @brief  コンストラクタ
        //@―---------------------------------------------------------------------------
        RenderTexture()=default;


        //@―---------------------------------------------------------------------------
        //! @brief  コンストラクタ
        //! 
        //! @param targets  各レンダ―ターゲットの定義
        //! @param depth    デプス・ステンシル・テクスチャの定義
        //! @param name     オブジェクト名
        //@―---------------------------------------------------------------------------
        RenderTexture(const gsl::span<TextureDesc> targets, const TextureDesc& depth, StringView name=TC("RenderTexture"));


        //@―---------------------------------------------------------------------------
        //! @brief  テクスチャを取得
        //! 
        //! @param index    マルチレンダーターゲットのインデックス
        //@―---------------------------------------------------------------------------
        Texture getTexture(s32 index=0);

    private:

        IRenderTexture* m_pImpl=nullptr;

    };






    //===============================================================
    // インライン関数
    //===============================================================
    //! @cond



    //! @endcond
}// namespcae ob::graphic