//***********************************************************
//! @file
//! @brief		ルートシグネチャ
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Utility/GraphicObjectHolder.h>
#include <Framework/Graphic/Types/RootSignatureDesc.h>

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief  ルートシグネチャ
    //@―---------------------------------------------------------------------------
    class RootSignature {
        friend class Device;
        OB_DEFINE_GRAPHIC_OBJECT_HOLDER(RootSignature);
    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================

        //@―---------------------------------------------------------------------------
        //! @brief  コンストラクタ
        //@―---------------------------------------------------------------------------
        RootSignature();


        //@―---------------------------------------------------------------------------
        //! @brief  デストラクタ
        //@―---------------------------------------------------------------------------
        RootSignature(const RootSignatureDesc& desc, StringView name = TC("RootSignature"));

    };

}// namespcae ob::graphic