//***********************************************************
//! @file
//! @brief		グラフィック・システム
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/Types/SystemDesc.h>
#include <Framework/Graphic/Interface/IDevice.h>



//===============================================================
// 前方宣言
//===============================================================
namespace ob::graphic {
    class Device;
    class GraphicObject;
    class GraphicObjectManager;
}


//===============================================================
// クラス永木
//===============================================================
namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief  説明
    //@―---------------------------------------------------------------------------
    class System :public Singleton<System> {
        friend class Device;
        friend class GraphicObject;
    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================
        System();
        ~System();

        //@―---------------------------------------------------------------------------
        //! @brief          初期化
        //! 
        //! @details        プラットフォームにより使用できないAPIがあります。
        //!                 使用できるプラットフォームは GraphicAPI を参照してください。
        //!                 失敗した場合以前に初期化した状態が保持されます。
        //! @param desc     使用するグラフィックAPIタイプ
        //! @retval true    成功
        //! @retval false   失敗
        //@―---------------------------------------------------------------------------
        bool initialize(SystemDesc desc);


        //@―---------------------------------------------------------------------------
        //! @brief      更新
        //! 
        //! @details    グラフィック・オブジェクトを消去します。
        //!             1フレームに1回更新することでグラフィック・オブジェクトを
        //!             遅延削除することができます。
        //@―---------------------------------------------------------------------------
        void update();

    public:

        //@―---------------------------------------------------------------------------
        //! @brief      サポートしているAPIか
        //@―---------------------------------------------------------------------------
        static bool IsSupported(GraphicAPI api);


        //@―---------------------------------------------------------------------------
        //! @brief      サポートしているAPIリストを取得
        //@―---------------------------------------------------------------------------
        static set<GraphicAPI> GetSupportedApiList();


    private:

        //@―---------------------------------------------------------------------------
        //! @brief      デバイスを取得
        //@―---------------------------------------------------------------------------
        IDevice* getDevice();


        //@―---------------------------------------------------------------------------
        //! @brief      グラフィック・オブジェクトを登録
        //@―---------------------------------------------------------------------------
        void registerObject(GraphicObject& pObject);


        //@―---------------------------------------------------------------------------
        //! @brief      グラフィック・オブジェクトを解放
        //@―---------------------------------------------------------------------------
        void requestRelease(GraphicObject& pObject);

    private:

        std::unique_ptr<IDevice> m_device;
        std::unique_ptr<GraphicObjectManager> m_objectManager;

    };

}// namespcae ob::graphic