//***********************************************************
//! @file
//! @brief		テクスチャ
//! @author		Gajumaru
//***********************************************************
#include "Texture.h"
#include <Framework/Graphic/Interface/ITexture.h>
#include <Framework/Graphic/System.h>

namespace ob::graphic {

    OB_IMPLEMENT_GRAPHIC_OBJECT_HOLDER(Texture);

    //===============================================================
    // コンストラクタ / デストラクタ
    //===============================================================

    //@―---------------------------------------------------------------------------
    //! @brief  コンストラクタ
    //@―---------------------------------------------------------------------------
    Texture::Texture()
        : m_pImpl(nullptr) {

    }


    //@―---------------------------------------------------------------------------
    //! @brief  コンストラクタ
    //@―---------------------------------------------------------------------------
    Texture::Texture(ITexture& texture) {
        texture.addReference();
        m_pImpl = &texture;
    }


    //@―---------------------------------------------------------------------------
    //! @brief      テクスチャ定義を取得
    //@―---------------------------------------------------------------------------
    const TextureDesc& Texture::desc()const {
        OB_CHECK_ASSERT(m_pImpl != nullptr);
        return m_pImpl->getDesc();
    }


    //@―---------------------------------------------------------------------------
    //! @brief      テクスチャ・サイズを取得
    //@―---------------------------------------------------------------------------
    Size Texture::size()const {
        OB_CHECK_ASSERT(m_pImpl != nullptr);
        return m_pImpl->getDesc().size;
    }


    //@―---------------------------------------------------------------------------
    //! @brief      テクスチャ・フォーマットを取得
    //@―---------------------------------------------------------------------------
    auto Texture::format()const->TextureFormat {
        OB_CHECK_ASSERT(m_pImpl != nullptr);
        return m_pImpl->getDesc().format;
    }


    //@―---------------------------------------------------------------------------
    //! @brief      ミップマップを持っているか
    //@―---------------------------------------------------------------------------
    s32 Texture::mipLevels()const {
        OB_CHECK_ASSERT(m_pImpl != nullptr);
        return m_pImpl->getDesc().mipLevel;
    }


    //@―---------------------------------------------------------------------------
    //! @brief      テクスチャタイプを取得
    //@―---------------------------------------------------------------------------
    TextureType Texture::type()const {
        OB_CHECK_ASSERT(m_pImpl != nullptr);
        return m_pImpl->getDesc().type;
    }

}// namespace ob::graphic