//***********************************************************
//! @file
//! @brief		デバイス実装(DirectX12)
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/RHI/IDevice.h>
#include <Framework/RHI/Types/FeatureLevel.h>
#include <Framework/RHI/Types/DescriptorDesc.h>

//===============================================================
// クラス定義
//===============================================================
namespace ob::rhi::dx12 {

	class DeviceImpl :public IDevice {
	public:

		//===============================================================
		// コンストラクタ / デストラクタ
		//===============================================================

		//@―---------------------------------------------------------------------------
		//! @brief  コンストラクタ
		//@―---------------------------------------------------------------------------
		DeviceImpl(FeatureLevel featureLevel);

		//@―---------------------------------------------------------------------------
		//! @brief  デストラクタ
		//@―---------------------------------------------------------------------------
		~DeviceImpl();


		//@―---------------------------------------------------------------------------
		//! @brief  妥当な状態か
		//@―---------------------------------------------------------------------------
		bool isValid()const override;


		//===============================================================
		// 更新
		//===============================================================

		void entryCommandList(const class CommandList&) override;
		void update()override;


		//===============================================================
		// 生成
		//===============================================================

		//@―---------------------------------------------------------------------------
		//! @brief  レンダーパス生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IRenderPass* createRenderPass(const RenderPassDesc& desc)override;

		//@―---------------------------------------------------------------------------
		//! @brief  フレームバッファを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IFrameBuffer* createFrameBuffer(const FrameBufferDesc& desc)override;

		//@―---------------------------------------------------------------------------
		//! @brief  スワップ・チェーンを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IDisplay* createDisplay(const DisplayDesc& desc)override;


		//@―---------------------------------------------------------------------------
		//! @brief  コマンドリスト生成
		//@―---------------------------------------------------------------------------
		ob::rhi::ICommandList* createCommandList(const CommandListDesc& desc)override;


		//@―---------------------------------------------------------------------------
		//! @brief  ルートシグネチャを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IRootSignature* createRootSignature(const RootSignatureDesc& desc)override;


		//@―---------------------------------------------------------------------------
		//! @brief  パイプラインステートを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IPipelineState* createPipelineState(const PipelineStateDesc& desc)override;


		//@―---------------------------------------------------------------------------
		//! @brief  テクスチャを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::ITexture* createTexture(const TextureDesc& desc)override;


		//@―---------------------------------------------------------------------------
		//! @brief  テクスチャを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::ITexture* createTexture(BlobView blob)override;


		//@―---------------------------------------------------------------------------
		//! @brief  レンダーテクスチャを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IRenderTexture* createRenderTexture(const RenderTextureDesc& desc)override;


		//@―---------------------------------------------------------------------------
		//! @brief  バッファーを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IBuffer* createBuffer(const BufferDesc& desc) override;


		//@―---------------------------------------------------------------------------
		//! @brief  シェーダを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IShader* createShader(const String&, ShaderStage) override;


		//@―---------------------------------------------------------------------------
		//! @brief  シェーダを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IShader* createShader(const Blob&, ShaderStage) override;


		//@―---------------------------------------------------------------------------
		//! @brief  デスクリプタ・テーブルを生成
		//@―---------------------------------------------------------------------------
		ob::rhi::IDescriptorTable* createDescriptorTable(DescriptorHeapType type, s32 elementNum)override;

	public:

		//===============================================================
		// ゲッター
		//===============================================================

		//@―---------------------------------------------------------------------------
		//! @brief  ネイティブ・デバイスを取得
		//@―---------------------------------------------------------------------------
		ComPtr<ID3D12Device8>& getNative();


		//@―---------------------------------------------------------------------------
		//! @brief  ファクトリを取得
		//@―---------------------------------------------------------------------------
		ComPtr<IDXGIFactory7>& getFactory();


		//@―---------------------------------------------------------------------------
		//! @brief  システム・コマンド・キューを取得
		//@―---------------------------------------------------------------------------
		ComPtr<ID3D12CommandQueue>& getCommandQueue();


		//@―---------------------------------------------------------------------------
		//! @brief  システム・コマンド・リストを取得
		//@―---------------------------------------------------------------------------
		//ComPtr<ID3D12GraphicsCommandList>& getSystemCommandList();


		//@―---------------------------------------------------------------------------
		//! @brief          ハンドルをアロケート
		//! 
		//! @param type     ヒープタイプ
		//! @param handle   アロケート先ハンドル
		//! @param size     割り当て個数
		//@―---------------------------------------------------------------------------
		void allocateHandle(DescriptorHeapType type, class DescriptorHandle& handle, s32 size);


		//@―---------------------------------------------------------------------------
		//! @brief          デスクリプタヒープを設定
		//@―---------------------------------------------------------------------------
		void setDescriptorHeaps(class CommandListImpl& cmdList);


	private:

		bool initialize();

		bool initializeDXGIDevice();
		bool initializeCommand();
		bool initializeFence();
		bool initializeVideoCardInfo();
		bool initializeDescriptorHeaps();

	private:

		FeatureLevel                        m_featureLevel;             // フィーチャーレベル
		ComPtr<ID3D12Device8>               m_device;                   // D3D12のデバイス本体
		ComPtr<IDXGIFactory7>               m_dxgiFactory;              // DXGIインターフェイス

		ComPtr<ID3D12CommandAllocator>      m_commandAllocator;         // コマンドアロケータ
		//ComPtr<ID3D12CommandQueue>          m_commandQueue;             // コマンドキュー
		//ComPtr<ID3D12GraphicsCommandList>   m_systemCmdList;            // システムコマンドリスト

		UPtr<class CommandQueue>			m_commandQueue;

		ComPtr<ID3D12Fence>                 m_fence;
		UINT64                              m_fenceVal;


		Array<std::unique_ptr<class DescriptorHeap>>        m_descriptorHeaps;          // デスクリプタ・ヒープ・リスト

#ifdef OB_DEBUG
		Pimpl<class PIXModule> m_pixModule;
#endif
	};
}// namespace ob::rhi::dx12






//===============================================================
// インライン
//===============================================================
namespace ob::rhi::dx12 {

	//@―---------------------------------------------------------------------------
	//! @brief  ネイティブ・デバイスを取得
	//@―---------------------------------------------------------------------------
	inline ComPtr<ID3D12Device8>& DeviceImpl::getNative() {
		return m_device;
	}


	//@―---------------------------------------------------------------------------
	//! @brief  ファクトリを取得
	//@―---------------------------------------------------------------------------
	inline ComPtr<IDXGIFactory7>& DeviceImpl::getFactory() {
		return m_dxgiFactory;
	}

}// namespace ob::rhi::dx12