//***********************************************************
//! @file
//! @brief		ウィンドウ
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Runtime/Platform/Type/SystemEventType.h>
#include <Runtime/Platform/Type/CursorType.h>
#include <Runtime/Platform/Type/GeometoryType.h>
#include <Runtime/Platform/Type/WindowCreationParams.h>

namespace ob {
    namespace platform {

        class WindowImpl;
        class WindowNativeAccessor;

        //@―---------------------------------------------------------------------------
        //! @brief  ウィンドウ
        //@―---------------------------------------------------------------------------
        class Window:public RefObject{
            friend class WindowNativeAccessor;
        public:

            //@―---------------------------------------------------------------------------
            //! @brief      コンストラクタ
            //! 
            //! @details    生成情報を指定してウィンドウを生成する。
            //@―---------------------------------------------------------------------------
            Window(const WindowCreationDesc& desc);
            ~Window();

            //@―---------------------------------------------------------------------------
            //! @brief      ウィンドウを表示する
            //@―---------------------------------------------------------------------------
            void Show();


            //@―---------------------------------------------------------------------------
            //! @brief      ウィンドウを閉じる
            //@―---------------------------------------------------------------------------
            void Close();


            //@―---------------------------------------------------------------------------
            //! @brief      ウィンドウ・イベントのリスナを追加する
            //@―---------------------------------------------------------------------------
            void AddEventListener(WindowEventType type,const WindowEvent& event);


            //@―---------------------------------------------------------------------------
            //! @brief      ウィンドウのタイトルを設定する
            //@―---------------------------------------------------------------------------
            void SetWindowTitle(const String& title);


            //@―---------------------------------------------------------------------------
            //! @brief      ウィンドウサイズの取得
            //@―---------------------------------------------------------------------------
            Size GetSize()const;


            //@―---------------------------------------------------------------------------
            //! @brief              スクリーン座標の取得
            //! 
            //! @details            クライアント座標をスクリーン座標に変換して取得する。
            //! @patam clientPoint  クライアント座標
            //! @return             スクリーン座標
            //@―---------------------------------------------------------------------------
            Point GetScreenPoint(const Point& clientPoint)const;


            //@―---------------------------------------------------------------------------
            //! @brief              クライアント座標の取得
            //! 
            //! @details            スクリーン座標をクライアント座標に変換して取得する。
            //! @patam screenPoint  スクリーン座標  
            //! @return             クライアント座標
            //@―---------------------------------------------------------------------------
            Point GetClientPoint(const Point& screenPoint)const;


            //@―---------------------------------------------------------------------------
            //! @brief              妥当な状態か
            //! 
            //! @details            システムからウィンドウのクローズ処理が呼ばれた場合false
            //!                     を返すようになります。
            //@―---------------------------------------------------------------------------
            bool IsValid()const noexcept;

        private:

            WindowImpl* m_impl;

        };

    }// namespace platform
}// namespcae ob