//***********************************************************
//! @file
//! @brief		CRCハッシュ関数
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Core/CoreTypes.h>

namespace ob::core {

    //@―---------------------------------------------------------------------------
    //! @brief ハッシュ値の計算を行うクラス
    //@―---------------------------------------------------------------------------
    class CRCHash {
    public:

        //@―---------------------------------------------------------------------------
        //! @brief 指定した文字列のハッシュ値を求める
        //! 
        //! @param str 元文字配列
        //! @param len 配列の長さ
        //! @return ハッシュ値
        //@―---------------------------------------------------------------------------
        static u32 Compute(const char* str, s32 len = -1);


        //@―---------------------------------------------------------------------------
        //! @brief 指定した文字列のハッシュ値を求める
        //! 
        //! @param str 元文字配列
        //! @param len 配列の長さ
        //! @return ハッシュ値
        //@―---------------------------------------------------------------------------
        static u32 Compute(const wchar_t* str, s32 len = -1);


        //@―---------------------------------------------------------------------------
        //! @brief 指定した文字列のハッシュ値を求める
        //! 
        //! @param str 元文字配列
        //! @param len 配列の長さ
        //! @return ハッシュ値
        //@―---------------------------------------------------------------------------
        static u32 Compute(const char16_t* str, s32 len = -1);


        //@―---------------------------------------------------------------------------
        //! @brief 指定した文字列のハッシュ値を求める
        //! 
        //! @param str 元文字配列
        //! @param len 配列の長さ
        //! @return ハッシュ値
        //@―---------------------------------------------------------------------------
        static u32 Compute(const char32_t* str, s32 len = -1);

    };

    //! @cond
    namespace detail {
        struct CRCHashInternal {
            static const unsigned* GetCRCTable();
        };

    } // namespace detail
    //! @endcond

} // namespace ob::core
