//***********************************************************
//! @file
//! @brief		ファイル説明
//! @author		Gajumaru
//***********************************************************
#pragma once
#include <Framework/Graphic/RenderContext.h>
#include <Framework/RHI/CommandList.h>
#include <Framework/Graphic/Camera.h>

namespace ob::graphic {

    //@―---------------------------------------------------------------------------
    //! @brief  
    //! 
    //! @details    内部的にCommandBufferを持っています。独自の描画方法を使用する場合は
    //!             CommandBufferに直接コマンドを記録し、executeCommandBuffer()を記録してください。
    //!             RenderContextはRenderPassの構築を内部的に処理するために、すべての描画処理を
    //!             endRenderPassで行います。それ以前の描画コマンドはLinearAllocatorに追加していきます。
    //@―---------------------------------------------------------------------------
    class RenderPassCache {
    public:

        //===============================================================
        // コンストラクタ / デストラクタ
        //===============================================================

        //@―---------------------------------------------------------------------------
        //! @brief      コンストラクタ
        //@―---------------------------------------------------------------------------



    };

}// namespcae ob